STMicroelectronics/STM32_open_pin_data/boards/M10_Evaluation_Board_STM32MP157F-EV1_STM32MP157FAA_Board_AllConfig.ioc
#Copyright (c) 2024 STMicroelectronics. All rights reserved.
#MicroXplorer Configuration settings - do not modify
BootLoader.IPs=RCC,DDR,I2C4,QUADSPI,SDMMC1,SDMMC2,UART4,FMC,CRYP1,HASH1,USB_OTG_HS,TAMP,IWDG1
BootROM.IPs=FMC,QUADSPI,SDMMC1,SDMMC2,USB_OTG_HS,UART4,RCC,TAMP
CAD.formats=
CAD.pinconfig=
CAD.provider=
CortexA7NS.IPs=DDR,RCC,RTC,SDMMC1,SDMMC2,QUADSPI,DCMI,ETH1,SAI2,SPDIFRX,USB_OTG_HS,FDCAN1,UART4,I2C2,I2C4,FMC,DFSDM1,SAI4,DSIHOST,LTDC,BSEC,ETZPC,GIC,IPCC,GPU,TAMP,DTS,PWR,DMA,TIM6,USBH_HS1,HSEM,CRC1,HDMI_CEC,I2C5,CRYP1,HASH1,GPIO
CortexA7S.IPs=IWDG1,BSEC,ETZPC,GIC\:I,RCC,PWR,TIM15,RNG1,RTC,I2C4,DDR,HSEM,TAMP
CortexM4.IPs=IPCC,NVIC\:I,RCC,WWDG1,ETZPC,FREERTOS,SYS\:I,DMA,PWR,OPENAMP,HSEM,GPIO
DDR.DDR_Frequency=533.0
DDR.DFITMG0=0x02060105
DDR.IPParameters=DDR_Frequency,RL,addrmap_col_b10,addrmap_col_b11,addrmap_bank_b0,addrmap_bank_b1,addrmap_bank_b2,addrmap_row_b0,addrmap_row_b1,addrmap_row_b2_10,addrmap_row_b11,addrmap_row_b12,addrmap_row_b13,addrmap_row_b14,addrmap_row_b15,DFITMG0,SCHED
DDR.RL=8
DDR.SCHED=0x00000C01
DDR.addrmap_bank_b0=8
DDR.addrmap_bank_b1=8
DDR.addrmap_bank_b2=8
DDR.addrmap_col_b10=31
DDR.addrmap_col_b11=31
DDR.addrmap_row_b0=7
DDR.addrmap_row_b1=7
DDR.addrmap_row_b11=7
DDR.addrmap_row_b12=7
DDR.addrmap_row_b13=7
DDR.addrmap_row_b14=7
DDR.addrmap_row_b15=15
DDR.addrmap_row_b2_10=7
DDR_A0.GPIOParameters=GPIO_Label,PinAttribute
DDR_A0.GPIO_Label=DDR_A0 [NT5CC256M16EP-DI_A0]
DDR_A0.Locked=true
DDR_A0.Mode=DDR3
DDR_A0.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A0.Signal=DDR_A0
DDR_A1.GPIOParameters=GPIO_Label,PinAttribute
DDR_A1.GPIO_Label=DDR_A1 [NT5CC256M16EP-DI_A1]
DDR_A1.Locked=true
DDR_A1.Mode=DDR3
DDR_A1.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A1.Signal=DDR_A1
DDR_A10.GPIOParameters=GPIO_Label,PinAttribute
DDR_A10.GPIO_Label=DDR_A10 [NT5CC256M16EP-DI_A10]
DDR_A10.Locked=true
DDR_A10.Mode=DDR3
DDR_A10.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A10.Signal=DDR_A10
DDR_A11.GPIOParameters=GPIO_Label,PinAttribute
DDR_A11.GPIO_Label=DDR_A11 [NT5CC256M16EP-DI_A11]
DDR_A11.Locked=true
DDR_A11.Mode=DDR3
DDR_A11.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A11.Signal=DDR_A11
DDR_A12.GPIOParameters=GPIO_Label,PinAttribute
DDR_A12.GPIO_Label=DDR_A12 [NT5CC256M16EP-DI_A12]
DDR_A12.Locked=true
DDR_A12.Mode=8Gb_32bits
DDR_A12.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A12.Signal=DDR_A12
DDR_A13.GPIOParameters=GPIO_Label,PinAttribute
DDR_A13.GPIO_Label=DDR_A13 [NT5CC256M16EP-DI_A13]
DDR_A13.Locked=true
DDR_A13.Mode=8Gb_32bits
DDR_A13.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A13.Signal=DDR_A13
DDR_A14.GPIOParameters=GPIO_Label,PinAttribute
DDR_A14.GPIO_Label=DDR_A14 [NT5CC256M16EP-DI_A14]
DDR_A14.Locked=true
DDR_A14.Mode=8Gb_32bits
DDR_A14.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A14.Signal=DDR_A14
DDR_A2.GPIOParameters=GPIO_Label,PinAttribute
DDR_A2.GPIO_Label=DDR_A2 [NT5CC256M16EP-DI_A2]
DDR_A2.Locked=true
DDR_A2.Mode=DDR3
DDR_A2.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A2.Signal=DDR_A2
DDR_A3.GPIOParameters=GPIO_Label,PinAttribute
DDR_A3.GPIO_Label=DDR_A3 [NT5CC256M16EP-DI_A3]
DDR_A3.Locked=true
DDR_A3.Mode=DDR3
DDR_A3.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A3.Signal=DDR_A3
DDR_A4.GPIOParameters=GPIO_Label,PinAttribute
DDR_A4.GPIO_Label=DDR_A4 [NT5CC256M16EP-DI_A4]
DDR_A4.Locked=true
DDR_A4.Mode=DDR3
DDR_A4.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A4.Signal=DDR_A4
DDR_A5.GPIOParameters=GPIO_Label,PinAttribute
DDR_A5.GPIO_Label=DDR_A5 [NT5CC256M16EP-DI_A5]
DDR_A5.Locked=true
DDR_A5.Mode=DDR3
DDR_A5.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A5.Signal=DDR_A5
DDR_A6.GPIOParameters=GPIO_Label,PinAttribute
DDR_A6.GPIO_Label=DDR_A6 [NT5CC256M16EP-DI_A6]
DDR_A6.Locked=true
DDR_A6.Mode=DDR3
DDR_A6.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A6.Signal=DDR_A6
DDR_A7.GPIOParameters=GPIO_Label,PinAttribute
DDR_A7.GPIO_Label=DDR_A7 [NT5CC256M16EP-DI_A7]
DDR_A7.Locked=true
DDR_A7.Mode=DDR3
DDR_A7.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A7.Signal=DDR_A7
DDR_A8.GPIOParameters=GPIO_Label,PinAttribute
DDR_A8.GPIO_Label=DDR_A8 [NT5CC256M16EP-DI_A8]
DDR_A8.Locked=true
DDR_A8.Mode=DDR3
DDR_A8.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A8.Signal=DDR_A8
DDR_A9.GPIOParameters=GPIO_Label,PinAttribute
DDR_A9.GPIO_Label=DDR_A9 [NT5CC256M16EP-DI_A9]
DDR_A9.Locked=true
DDR_A9.Mode=DDR3
DDR_A9.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_A9.Signal=DDR_A9
DDR_ATO.GPIOParameters=GPIO_Label,PinAttribute
DDR_ATO.GPIO_Label=DDR_ATO
DDR_ATO.Locked=true
DDR_ATO.Mode=DDR3
DDR_ATO.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_ATO.Signal=DDR_ATO
DDR_BA0.GPIOParameters=GPIO_Label,PinAttribute
DDR_BA0.GPIO_Label=DDR_BA0 [NT5CC256M16EP-DI_BA0]
DDR_BA0.Locked=true
DDR_BA0.Mode=DDR3
DDR_BA0.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_BA0.Signal=DDR_BA0
DDR_BA1.GPIOParameters=GPIO_Label,PinAttribute
DDR_BA1.GPIO_Label=DDR_BA1 [NT5CC256M16EP-DI_BA1]
DDR_BA1.Locked=true
DDR_BA1.Mode=DDR3
DDR_BA1.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_BA1.Signal=DDR_BA1
DDR_BA2.GPIOParameters=GPIO_Label,PinAttribute
DDR_BA2.GPIO_Label=DDR_BA2 [NT5CC256M16EP-DI_BA2]
DDR_BA2.Locked=true
DDR_BA2.Mode=DDR3
DDR_BA2.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_BA2.Signal=DDR_BA2
DDR_CASN.GPIOParameters=GPIO_Label,PinAttribute
DDR_CASN.GPIO_Label=DDR_CASN [NT5CC256M16EP-DI_CAS\#]
DDR_CASN.Locked=true
DDR_CASN.Mode=DDR3
DDR_CASN.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_CASN.Signal=DDR_CASN
DDR_CKE.GPIOParameters=GPIO_Label,PinAttribute
DDR_CKE.GPIO_Label=DDR_CKE [NT5CC256M16EP-DI_CKE]
DDR_CKE.Locked=true
DDR_CKE.Mode=DDR3
DDR_CKE.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_CKE.Signal=DDR_CKE
DDR_CLKN.GPIOParameters=GPIO_Label,PinAttribute
DDR_CLKN.GPIO_Label=DDR_CLK_N [NT5CC256M16EP-DI_CK\#]
DDR_CLKN.Locked=true
DDR_CLKN.Mode=DDR3
DDR_CLKN.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_CLKN.Signal=DDR_CLKN
DDR_CLKP.GPIOParameters=GPIO_Label,PinAttribute
DDR_CLKP.GPIO_Label=DDR_CLK_P [NT5CC256M16EP-DI_CK]
DDR_CLKP.Locked=true
DDR_CLKP.Mode=DDR3
DDR_CLKP.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_CLKP.Signal=DDR_CLKP
DDR_CSN.GPIOParameters=GPIO_Label,PinAttribute
DDR_CSN.GPIO_Label=DDR_CSN [NT5CC256M16EP-DI_CS\#]
DDR_CSN.Locked=true
DDR_CSN.Mode=DDR3
DDR_CSN.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_CSN.Signal=DDR_CSN
DDR_DQ0.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ0.GPIO_Label=DDR_DQ0 [NT5CC256M16EP-DI_DQU0]
DDR_DQ0.Locked=true
DDR_DQ0.Mode=DDR3
DDR_DQ0.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ0.Signal=DDR_DQ0
DDR_DQ1.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ1.GPIO_Label=DDR_DQ1 [NT5CC256M16EP-DI_DQU4]
DDR_DQ1.Locked=true
DDR_DQ1.Mode=DDR3
DDR_DQ1.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ1.Signal=DDR_DQ1
DDR_DQ10.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ10.GPIO_Label=DDR_DQ10 [NT5CC256M16EP-DI_DQL2]
DDR_DQ10.Locked=true
DDR_DQ10.Mode=DDR3
DDR_DQ10.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ10.Signal=DDR_DQ10
DDR_DQ11.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ11.GPIO_Label=DDR_DQ11 [NT5CC256M16EP-DI_DQL1]
DDR_DQ11.Locked=true
DDR_DQ11.Mode=DDR3
DDR_DQ11.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ11.Signal=DDR_DQ11
DDR_DQ12.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ12.GPIO_Label=DDR_DQ12 [NT5CC256M16EP-DI_DQL7]
DDR_DQ12.Locked=true
DDR_DQ12.Mode=DDR3
DDR_DQ12.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ12.Signal=DDR_DQ12
DDR_DQ13.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ13.GPIO_Label=DDR_DQ13 [NT5CC256M16EP-DI_DQL6]
DDR_DQ13.Locked=true
DDR_DQ13.Mode=DDR3
DDR_DQ13.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ13.Signal=DDR_DQ13
DDR_DQ14.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ14.GPIO_Label=DDR_DQ14 [NT5CC256M16EP-DI_DQL3]
DDR_DQ14.Locked=true
DDR_DQ14.Mode=DDR3
DDR_DQ14.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ14.Signal=DDR_DQ14
DDR_DQ15.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ15.GPIO_Label=DDR_DQ15 [NT5CC256M16EP-DI_DQL5]
DDR_DQ15.Locked=true
DDR_DQ15.Mode=DDR3
DDR_DQ15.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ15.Signal=DDR_DQ15
DDR_DQ16.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ16.GPIO_Label=DDR_DQ16 [NT5CC256M16EP-DI_DQU0]
DDR_DQ16.Locked=true
DDR_DQ16.Mode=32bits
DDR_DQ16.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ16.Signal=DDR_DQ16
DDR_DQ17.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ17.GPIO_Label=DDR_DQ17 [NT5CC256M16EP-DI_DQU5]
DDR_DQ17.Locked=true
DDR_DQ17.Mode=32bits
DDR_DQ17.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ17.Signal=DDR_DQ17
DDR_DQ18.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ18.GPIO_Label=DDR_DQ18 [NT5CC256M16EP-DI_DQU7]
DDR_DQ18.Locked=true
DDR_DQ18.Mode=32bits
DDR_DQ18.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ18.Signal=DDR_DQ18
DDR_DQ19.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ19.GPIO_Label=DDR_DQ19 [NT5CC256M16EP-DI_DQU6]
DDR_DQ19.Locked=true
DDR_DQ19.Mode=32bits
DDR_DQ19.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ19.Signal=DDR_DQ19
DDR_DQ2.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ2.GPIO_Label=DDR_DQ2 [NT5CC256M16EP-DI_DQU7]
DDR_DQ2.Locked=true
DDR_DQ2.Mode=DDR3
DDR_DQ2.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ2.Signal=DDR_DQ2
DDR_DQ20.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ20.GPIO_Label=DDR_DQ20 [NT5CC256M16EP-DI_DQU2]
DDR_DQ20.Locked=true
DDR_DQ20.Mode=32bits
DDR_DQ20.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ20.Signal=DDR_DQ20
DDR_DQ21.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ21.GPIO_Label=DDR_DQ21 [NT5CC256M16EP-DI_DQU1]
DDR_DQ21.Locked=true
DDR_DQ21.Mode=32bits
DDR_DQ21.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ21.Signal=DDR_DQ21
DDR_DQ22.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ22.GPIO_Label=DDR_DQ22 [NT5CC256M16EP-DI_DQU3]
DDR_DQ22.Locked=true
DDR_DQ22.Mode=32bits
DDR_DQ22.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ22.Signal=DDR_DQ22
DDR_DQ23.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ23.GPIO_Label=DDR_DQ23 [NT5CC256M16EP-DI_DQU4]
DDR_DQ23.Locked=true
DDR_DQ23.Mode=32bits
DDR_DQ23.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ23.Signal=DDR_DQ23
DDR_DQ24.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ24.GPIO_Label=DDR_DQ24 [NT5CC256M16EP-DI_DQL0]
DDR_DQ24.Locked=true
DDR_DQ24.Mode=32bits
DDR_DQ24.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ24.Signal=DDR_DQ24
DDR_DQ25.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ25.GPIO_Label=DDR_DQ25 [NT5CC256M16EP-DI_DQL2]
DDR_DQ25.Locked=true
DDR_DQ25.Mode=32bits
DDR_DQ25.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ25.Signal=DDR_DQ25
DDR_DQ26.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ26.GPIO_Label=DDR_DQ26 [NT5CC256M16EP-DI_DQL3]
DDR_DQ26.Locked=true
DDR_DQ26.Mode=32bits
DDR_DQ26.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ26.Signal=DDR_DQ26
DDR_DQ27.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ27.GPIO_Label=DDR_DQ27 [NT5CC256M16EP-DI_DQL5]
DDR_DQ27.Locked=true
DDR_DQ27.Mode=32bits
DDR_DQ27.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ27.Signal=DDR_DQ27
DDR_DQ28.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ28.GPIO_Label=DDR_DQ28 [NT5CC256M16EP-DI_DQL1]
DDR_DQ28.Locked=true
DDR_DQ28.Mode=32bits
DDR_DQ28.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ28.Signal=DDR_DQ28
DDR_DQ29.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ29.GPIO_Label=DDR_DQ29 [NT5CC256M16EP-DI_DQL7]
DDR_DQ29.Locked=true
DDR_DQ29.Mode=32bits
DDR_DQ29.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ29.Signal=DDR_DQ29
DDR_DQ3.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ3.GPIO_Label=DDR_DQ3 [NT5CC256M16EP-DI_DQU6]
DDR_DQ3.Locked=true
DDR_DQ3.Mode=DDR3
DDR_DQ3.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ3.Signal=DDR_DQ3
DDR_DQ30.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ30.GPIO_Label=DDR_DQ30 [NT5CC256M16EP-DI_DQL6]
DDR_DQ30.Locked=true
DDR_DQ30.Mode=32bits
DDR_DQ30.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ30.Signal=DDR_DQ30
DDR_DQ31.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ31.GPIO_Label=DDR_DQ31 [NT5CC256M16EP-DI_DQL4]
DDR_DQ31.Locked=true
DDR_DQ31.Mode=32bits
DDR_DQ31.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ31.Signal=DDR_DQ31
DDR_DQ4.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ4.GPIO_Label=DDR_DQ4 [NT5CC256M16EP-DI_DQU1]
DDR_DQ4.Locked=true
DDR_DQ4.Mode=DDR3
DDR_DQ4.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ4.Signal=DDR_DQ4
DDR_DQ5.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ5.GPIO_Label=DDR_DQ5 [NT5CC256M16EP-DI_DQU3]
DDR_DQ5.Locked=true
DDR_DQ5.Mode=DDR3
DDR_DQ5.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ5.Signal=DDR_DQ5
DDR_DQ6.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ6.GPIO_Label=DDR_DQ6 [NT5CC256M16EP-DI_DQU5]
DDR_DQ6.Locked=true
DDR_DQ6.Mode=DDR3
DDR_DQ6.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ6.Signal=DDR_DQ6
DDR_DQ7.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ7.GPIO_Label=DDR_DQ7 [NT5CC256M16EP-DI_DQU2]
DDR_DQ7.Locked=true
DDR_DQ7.Mode=DDR3
DDR_DQ7.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ7.Signal=DDR_DQ7
DDR_DQ8.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ8.GPIO_Label=DDR_DQ8 [NT5CC256M16EP-DI_DQL0]
DDR_DQ8.Locked=true
DDR_DQ8.Mode=DDR3
DDR_DQ8.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ8.Signal=DDR_DQ8
DDR_DQ9.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQ9.GPIO_Label=DDR_DQ9 [NT5CC256M16EP-DI_DQL4]
DDR_DQ9.Locked=true
DDR_DQ9.Mode=DDR3
DDR_DQ9.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQ9.Signal=DDR_DQ9
DDR_DQM0.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQM0.GPIO_Label=DDR_DQM0 [NT5CC256M16EP-DI_DMU]
DDR_DQM0.Locked=true
DDR_DQM0.Mode=DDR3
DDR_DQM0.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQM0.Signal=DDR_DQM0
DDR_DQM1.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQM1.GPIO_Label=DDR_DQM1 [NT5CC256M16EP-DI_DML]
DDR_DQM1.Locked=true
DDR_DQM1.Mode=DDR3
DDR_DQM1.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQM1.Signal=DDR_DQM1
DDR_DQM2.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQM2.GPIO_Label=DDR_DQM2 [NT5CC256M16EP-DI_DMU]
DDR_DQM2.Locked=true
DDR_DQM2.Mode=32bits
DDR_DQM2.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQM2.Signal=DDR_DQM2
DDR_DQM3.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQM3.GPIO_Label=DDR_DQM3 [NT5CC256M16EP-DI_DML]
DDR_DQM3.Locked=true
DDR_DQM3.Mode=32bits
DDR_DQM3.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQM3.Signal=DDR_DQM3
DDR_DQS0N.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQS0N.GPIO_Label=DDR_DQS0_N [NT5CC256M16EP-DI_DQSU\#]
DDR_DQS0N.Locked=true
DDR_DQS0N.Mode=DDR3
DDR_DQS0N.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQS0N.Signal=DDR_DQS0N
DDR_DQS0P.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQS0P.GPIO_Label=DDR_DQS0_P [NT5CC256M16EP-DI_DQSU]
DDR_DQS0P.Locked=true
DDR_DQS0P.Mode=DDR3
DDR_DQS0P.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQS0P.Signal=DDR_DQS0P
DDR_DQS1N.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQS1N.GPIO_Label=DDR_DQS1_N [NT5CC256M16EP-DI_DQSL\#]
DDR_DQS1N.Locked=true
DDR_DQS1N.Mode=DDR3
DDR_DQS1N.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQS1N.Signal=DDR_DQS1N
DDR_DQS1P.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQS1P.GPIO_Label=DDR_DQS1_P [NT5CC256M16EP-DI_DQSL]
DDR_DQS1P.Locked=true
DDR_DQS1P.Mode=DDR3
DDR_DQS1P.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQS1P.Signal=DDR_DQS1P
DDR_DQS2N.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQS2N.GPIO_Label=DDR_DQS2_N [NT5CC256M16EP-DI_DQSU\#]
DDR_DQS2N.Locked=true
DDR_DQS2N.Mode=32bits
DDR_DQS2N.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQS2N.Signal=DDR_DQS2N
DDR_DQS2P.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQS2P.GPIO_Label=DDR_DQS2_P [NT5CC256M16EP-DI_DQSU]
DDR_DQS2P.Locked=true
DDR_DQS2P.Mode=32bits
DDR_DQS2P.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQS2P.Signal=DDR_DQS2P
DDR_DQS3N.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQS3N.GPIO_Label=DDR_DQS3_N [NT5CC256M16EP-DI_DQSL\#]
DDR_DQS3N.Locked=true
DDR_DQS3N.Mode=32bits
DDR_DQS3N.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQS3N.Signal=DDR_DQS3N
DDR_DQS3P.GPIOParameters=GPIO_Label,PinAttribute
DDR_DQS3P.GPIO_Label=DDR_DQS3_P [NT5CC256M16EP-DI_DQSL]
DDR_DQS3P.Locked=true
DDR_DQS3P.Mode=32bits
DDR_DQS3P.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DQS3P.Signal=DDR_DQS3P
DDR_DTO0.GPIOParameters=GPIO_Label,PinAttribute
DDR_DTO0.GPIO_Label=DDR_DTO0
DDR_DTO0.Locked=true
DDR_DTO0.Mode=DDR3
DDR_DTO0.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DTO0.Signal=DDR_DTO0
DDR_DTO1.GPIOParameters=GPIO_Label,PinAttribute
DDR_DTO1.GPIO_Label=DDR_DTO1
DDR_DTO1.Locked=true
DDR_DTO1.Mode=DDR3
DDR_DTO1.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_DTO1.Signal=DDR_DTO1
DDR_ODT.GPIOParameters=GPIO_Label,PinAttribute
DDR_ODT.GPIO_Label=DDR_ODT [NT5CC256M16EP-DI_ODT]
DDR_ODT.Locked=true
DDR_ODT.Mode=DDR3
DDR_ODT.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_ODT.Signal=DDR_ODT
DDR_RASN.GPIOParameters=GPIO_Label,PinAttribute
DDR_RASN.GPIO_Label=DDR_RASN [NT5CC256M16EP-DI_RAS\#]
DDR_RASN.Locked=true
DDR_RASN.Mode=DDR3
DDR_RASN.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_RASN.Signal=DDR_RASN
DDR_RESETN.GPIOParameters=GPIO_Label,PinAttribute
DDR_RESETN.GPIO_Label=DDR_RESETN [NT5CC256M16EP-DI_RESET\#]
DDR_RESETN.Locked=true
DDR_RESETN.Mode=DDR3
DDR_RESETN.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_RESETN.Signal=DDR_RESETN
DDR_VREF.GPIOParameters=GPIO_Label,PinAttribute
DDR_VREF.GPIO_Label=VREF_DDR
DDR_VREF.Locked=true
DDR_VREF.Mode=DDR3
DDR_VREF.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_VREF.Signal=DDR_VREF
DDR_WEN.GPIOParameters=GPIO_Label,PinAttribute
DDR_WEN.GPIO_Label=DDR_WEN [NT5CC256M16EP-DI_WE\#]
DDR_WEN.Locked=true
DDR_WEN.Mode=DDR3
DDR_WEN.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_WEN.Signal=DDR_WEN
DDR_ZQ.GPIOParameters=GPIO_Label,PinAttribute
DDR_ZQ.GPIO_Label=DDR_ZQ
DDR_ZQ.Locked=true
DDR_ZQ.Mode=DDR3
DDR_ZQ.PinAttribute=BootLoader,CortexA7S,CortexA7NS
DDR_ZQ.Signal=DDR_ZQ
DSIHOST_CKN.GPIOParameters=PinAttribute
DSIHOST_CKN.Locked=true
DSIHOST_CKN.Mode=DSIHost_Video
DSIHOST_CKN.PinAttribute=CortexA7NS
DSIHOST_CKN.Signal=DSIHOST_CKN
DSIHOST_CKP.GPIOParameters=PinAttribute
DSIHOST_CKP.Locked=true
DSIHOST_CKP.Mode=DSIHost_Video
DSIHOST_CKP.PinAttribute=CortexA7NS
