STMicroelectronics/STM32_open_pin_data/boards/M10_Evaluation_Board_STM32MP157F-EV1_STM32MP157FAA_Board_AllConfig.ioc
DSIHOST_CKP.Signal=DSIHOST_CKP
DSIHOST_D0N.GPIOParameters=PinAttribute
DSIHOST_D0N.Locked=true
DSIHOST_D0N.Mode=DSIHost_Video
DSIHOST_D0N.PinAttribute=CortexA7NS
DSIHOST_D0N.Signal=DSIHOST_D0N
DSIHOST_D0P.GPIOParameters=PinAttribute
DSIHOST_D0P.Locked=true
DSIHOST_D0P.Mode=DSIHost_Video
DSIHOST_D0P.PinAttribute=CortexA7NS
DSIHOST_D0P.Signal=DSIHOST_D0P
DSIHOST_D1N.GPIOParameters=PinAttribute
DSIHOST_D1N.Locked=true
DSIHOST_D1N.Mode=DSIHost_Video
DSIHOST_D1N.PinAttribute=CortexA7NS
DSIHOST_D1N.Signal=DSIHOST_D1N
DSIHOST_D1P.GPIOParameters=PinAttribute
DSIHOST_D1P.Locked=true
DSIHOST_D1P.Mode=DSIHost_Video
DSIHOST_D1P.PinAttribute=CortexA7NS
DSIHOST_D1P.Signal=DSIHOST_D1P
Dma.DCMI.2.Direction=DMA_PERIPH_TO_MEMORY
Dma.DCMI.2.EventEnable=DISABLE
Dma.DCMI.2.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.DCMI.2.Instance=DMA1_Stream0
Dma.DCMI.2.MDMA_Chaining=ENABLE
Dma.DCMI.2.Mandatory=DISABLE
Dma.DCMI.2.MemDataAlignment=DMA_MDATAALIGN_WORD
Dma.DCMI.2.MemInc=DMA_MINC_ENABLE
Dma.DCMI.2.Mode=DMA_NORMAL
Dma.DCMI.2.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.DCMI.2.PeriphInc=DMA_PINC_DISABLE
Dma.DCMI.2.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.DCMI.2.Priority=DMA_PRIORITY_LOW
Dma.DCMI.2.RequestNumber=1
Dma.DCMI.2.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber,MDMA_Chaining,Mandatory
Dma.DCMI.2.SignalID=NONE
Dma.DCMI.2.SyncEnable=DISABLE
Dma.DCMI.2.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.DCMI.2.SyncRequestNumber=1
Dma.DCMI.2.SyncSignalID=NONE
Dma.Request0=SPDIF_RX_CS
Dma.Request1=SAI2_A
Dma.Request2=DCMI
Dma.Request3=SPDIF_RX_DT
Dma.Request4=SAI2_B
Dma.Request5=SAI4_A
Dma.RequestsNb=6
Dma.SAI2_A.1.Direction=DMA_MEMORY_TO_PERIPH
Dma.SAI2_A.1.EventEnable=DISABLE
Dma.SAI2_A.1.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.SAI2_A.1.Instance=DMA1_Stream1
Dma.SAI2_A.1.MDMA_Chaining=ENABLE
Dma.SAI2_A.1.Mandatory=DISABLE
Dma.SAI2_A.1.MemDataAlignment=DMA_MDATAALIGN_WORD
Dma.SAI2_A.1.MemInc=DMA_MINC_ENABLE
Dma.SAI2_A.1.Mode=DMA_NORMAL
Dma.SAI2_A.1.PeriphDataAlignment=DMA_PDATAALIGN_WORD
Dma.SAI2_A.1.PeriphInc=DMA_PINC_DISABLE
Dma.SAI2_A.1.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.SAI2_A.1.Priority=DMA_PRIORITY_LOW
Dma.SAI2_A.1.RequestNumber=1
Dma.SAI2_A.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber,MDMA_Chaining,Mandatory
Dma.SAI2_A.1.SignalID=NONE
Dma.SAI2_A.1.SyncEnable=DISABLE
Dma.SAI2_A.1.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.SAI2_A.1.SyncRequestNumber=1
Dma.SAI2_A.1.SyncSignalID=NONE
Dma.SAI2_B.4.Direction=DMA_MEMORY_TO_PERIPH
Dma.SAI2_B.4.EventEnable=DISABLE
Dma.SAI2_B.4.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.SAI2_B.4.Instance=DMA1_Stream2
Dma.SAI2_B.4.MDMA_Chaining=ENABLE
Dma.SAI2_B.4.Mandatory=DISABLE
Dma.SAI2_B.4.MemDataAlignment=DMA_MDATAALIGN_WORD
Dma.SAI2_B.4.MemInc=DMA_MINC_ENABLE
Dma.SAI2_B.4.Mode=DMA_NORMAL
Dma.SAI2_B.4.PeriphDataAlignment=DMA_PDATAALIGN_WORD
Dma.SAI2_B.4.PeriphInc=DMA_PINC_DISABLE
Dma.SAI2_B.4.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.SAI2_B.4.Priority=DMA_PRIORITY_LOW
Dma.SAI2_B.4.RequestNumber=1
Dma.SAI2_B.4.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber,MDMA_Chaining,Mandatory
Dma.SAI2_B.4.SignalID=NONE
Dma.SAI2_B.4.SyncEnable=DISABLE
Dma.SAI2_B.4.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.SAI2_B.4.SyncRequestNumber=1
Dma.SAI2_B.4.SyncSignalID=NONE
Dma.SAI4_A.5.Direction=DMA_MEMORY_TO_PERIPH
Dma.SAI4_A.5.EventEnable=DISABLE
Dma.SAI4_A.5.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.SAI4_A.5.Instance=DMA1_Stream3
Dma.SAI4_A.5.MDMA_Chaining=ENABLE
Dma.SAI4_A.5.Mandatory=DISABLE
Dma.SAI4_A.5.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.SAI4_A.5.MemInc=DMA_MINC_ENABLE
Dma.SAI4_A.5.Mode=DMA_NORMAL
Dma.SAI4_A.5.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.SAI4_A.5.PeriphInc=DMA_PINC_DISABLE
Dma.SAI4_A.5.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.SAI4_A.5.Priority=DMA_PRIORITY_LOW
Dma.SAI4_A.5.RequestNumber=1
Dma.SAI4_A.5.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber,MDMA_Chaining,Mandatory
Dma.SAI4_A.5.SignalID=NONE
Dma.SAI4_A.5.SyncEnable=DISABLE
Dma.SAI4_A.5.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.SAI4_A.5.SyncRequestNumber=1
Dma.SAI4_A.5.SyncSignalID=NONE
Dma.SPDIF_RX_CS.0.Direction=DMA_PERIPH_TO_MEMORY
Dma.SPDIF_RX_CS.0.EventEnable=DISABLE
Dma.SPDIF_RX_CS.0.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.SPDIF_RX_CS.0.Instance=DMA1_Stream5
Dma.SPDIF_RX_CS.0.MDMA_Chaining=DISABLE
Dma.SPDIF_RX_CS.0.Mandatory=DISABLE
Dma.SPDIF_RX_CS.0.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.SPDIF_RX_CS.0.MemInc=DMA_MINC_ENABLE
Dma.SPDIF_RX_CS.0.Mode=DMA_NORMAL
Dma.SPDIF_RX_CS.0.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.SPDIF_RX_CS.0.PeriphInc=DMA_PINC_DISABLE
Dma.SPDIF_RX_CS.0.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.SPDIF_RX_CS.0.Priority=DMA_PRIORITY_LOW
Dma.SPDIF_RX_CS.0.RequestNumber=1
Dma.SPDIF_RX_CS.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber,MDMA_Chaining,Mandatory
Dma.SPDIF_RX_CS.0.SignalID=NONE
Dma.SPDIF_RX_CS.0.SyncEnable=DISABLE
Dma.SPDIF_RX_CS.0.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.SPDIF_RX_CS.0.SyncRequestNumber=1
Dma.SPDIF_RX_CS.0.SyncSignalID=NONE
Dma.SPDIF_RX_DT.3.Direction=DMA_PERIPH_TO_MEMORY
Dma.SPDIF_RX_DT.3.EventEnable=DISABLE
Dma.SPDIF_RX_DT.3.FIFOMode=DMA_FIFOMODE_DISABLE
Dma.SPDIF_RX_DT.3.Instance=DMA1_Stream4
Dma.SPDIF_RX_DT.3.MDMA_Chaining=ENABLE
Dma.SPDIF_RX_DT.3.Mandatory=DISABLE
Dma.SPDIF_RX_DT.3.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.SPDIF_RX_DT.3.MemInc=DMA_MINC_ENABLE
Dma.SPDIF_RX_DT.3.Mode=DMA_NORMAL
Dma.SPDIF_RX_DT.3.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
Dma.SPDIF_RX_DT.3.PeriphInc=DMA_PINC_DISABLE
Dma.SPDIF_RX_DT.3.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.SPDIF_RX_DT.3.Priority=DMA_PRIORITY_LOW
Dma.SPDIF_RX_DT.3.RequestNumber=1
Dma.SPDIF_RX_DT.3.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber,MDMA_Chaining,Mandatory
Dma.SPDIF_RX_DT.3.SignalID=NONE
Dma.SPDIF_RX_DT.3.SyncEnable=DISABLE
Dma.SPDIF_RX_DT.3.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
Dma.SPDIF_RX_DT.3.SyncRequestNumber=1
Dma.SPDIF_RX_DT.3.SyncSignalID=NONE
ETH1.IPParameters=MediaInterface
ETH1.MediaInterface=HAL_ETH_RGMII_MODE
FDCAN1.CalculateBaudRateNominal=928124
FDCAN1.CalculateTimeBitNominal=1077
FDCAN1.CalculateTimeQuantumNominal=215.4882154882155
FDCAN1.IPParameters=CalculateTimeQuantumNominal,CalculateTimeBitNominal,CalculateBaudRateNominal
File.Version=6
GIC.CEC_IRQn=true\:false\:High level
GIC.CRYP1_IRQn=true\:false\:High level
GIC.DCMI_IRQn=true\:false\:High level
GIC.DFSDM1_FLT0_IRQn=true\:false\:High level
GIC.DFSDM1_FLT1_IRQn=true\:false\:High level
GIC.DFSDM1_FLT2_IRQn=true\:false\:High level
GIC.DFSDM1_FLT3_IRQn=true\:false\:High level
GIC.DFSDM1_FLT4_IRQn=true\:false\:High level
GIC.DFSDM1_FLT5_IRQn=true\:false\:High level
GIC.DMA1_Stream0_IRQn=true\:false\:High level
GIC.DMA1_Stream1_IRQn=true\:false\:High level
GIC.DMA1_Stream2_IRQn=true\:false\:High level
GIC.DMA1_Stream3_IRQn=true\:false\:High level
GIC.DMA1_Stream4_IRQn=true\:false\:High level
GIC.DMA1_Stream5_IRQn=true\:false\:High level
GIC.DMA1_Stream6_IRQn=true\:false\:High level
GIC.DMA1_Stream7_IRQn=true\:false\:High level
GIC.DMA2_Stream0_IRQn=true\:false\:High level
GIC.DMA2_Stream1_IRQn=true\:false\:High level
GIC.DMA2_Stream2_IRQn=true\:false\:High level
GIC.DMA2_Stream3_IRQn=true\:false\:High level
GIC.DMA2_Stream4_IRQn=true\:false\:High level
GIC.DMA2_Stream5_IRQn=true\:false\:High level
GIC.DMA2_Stream6_IRQn=true\:false\:High level
GIC.DMA2_Stream7_IRQn=true\:false\:High level
GIC.DTS_IRQn=true\:false\:High level
GIC.ETH1_IRQn=true\:false\:High level
GIC.ETH1_WKUP_IRQn=true\:false\:High level
GIC.FDCAN1_IT0_IRQn=true\:false\:High level
GIC.FDCAN1_IT1_IRQn=true\:false\:High level
GIC.FMC_IRQn=true\:false\:High level
GIC.GPU_IRQn=true\:false\:High level
GIC.HASH1_IRQn=true\:false\:High level
GIC.I2C2_ER_IRQn=true\:false\:High level
GIC.I2C2_EV_IRQn=true\:false\:High level
GIC.I2C4_ER_IRQn=true\:false\:High level
GIC.I2C4_EV_IRQn=true\:false\:High level
GIC.I2C5_ER_IRQn=true\:false\:High level
GIC.I2C5_EV_IRQn=true\:false\:High level
GIC.IPCC_RX0_IRQn=true\:false\:High level
GIC.IPCC_TX0_IRQn=true\:false\:High level
GIC.LTDC_ER_IRQn=true\:false\:High level
GIC.LTDC_IRQn=true\:false\:High level
GIC.MDMA_IRQn=true\:false\:High level
GIC.OTG_IRQn=true\:false\:High level
GIC.QUADSPI_IRQn=true\:false\:High level
GIC.RCC_IRQn=true\:false\:High level
GIC.RTC_WKUP_ALARM_IRQn=true\:false\:High level
GIC.SAI2_IRQn=true\:false\:High level
GIC.SAI4_IRQn=true\:false\:High level
GIC.SDMMC1_IRQn=true\:false\:High level
GIC.SDMMC2_IRQn=true\:false\:High level
GIC.SPDIF_RX_IRQn=true\:false\:High level
GIC.UART4_IRQn=true\:false\:High level
GIC.USBH_OHCI_IRQn=true\:false\:High level
GIC.WAKEUP_PIN_IRQn=true\:false\:High level
I2C5.IPParameters=Timing
I2C5.Timing=0x10707DBC
KeepUserPlacement=false
Mcu.CPN=STM32MP157FAA1
Mcu.Context0=BootROM
Mcu.Context1=BootLoader
Mcu.Context2=CortexA7S
Mcu.Context3=CortexA7NS
Mcu.Context4=CortexM4
Mcu.ContextNb=5
Mcu.Family=STM32MP1
Mcu.IP0=BSEC
Mcu.IP1=CRC1
Mcu.IP10=ETZPC
Mcu.IP11=FDCAN1
Mcu.IP12=FMC
Mcu.IP13=GIC
Mcu.IP14=GPU
Mcu.IP15=HASH1
Mcu.IP16=HDMI_CEC
Mcu.IP17=HSEM
Mcu.IP18=I2C2
Mcu.IP19=I2C4
Mcu.IP2=CRYP1
Mcu.IP20=I2C5
Mcu.IP21=IPCC
Mcu.IP22=IWDG1
Mcu.IP23=LTDC
Mcu.IP24=MDMA
Mcu.IP25=NVIC
Mcu.IP26=OPENAMP
Mcu.IP27=PWR
Mcu.IP28=QUADSPI
Mcu.IP29=RCC
Mcu.IP3=DCMI
Mcu.IP30=RNG1
Mcu.IP31=RTC
Mcu.IP32=SAI2
Mcu.IP33=SAI4
Mcu.IP34=SDMMC1
Mcu.IP35=SDMMC2
Mcu.IP36=SPDIFRX
Mcu.IP37=SYS
Mcu.IP38=TAMP
Mcu.IP39=TIM6
Mcu.IP4=DDR
Mcu.IP40=TIM15
Mcu.IP41=UART4
Mcu.IP42=USBH_HS1
Mcu.IP43=USB_OTG_HS
Mcu.IP5=DFSDM1
Mcu.IP6=DMA
Mcu.IP7=DSIHOST
Mcu.IP8=DTS
Mcu.IP9=ETH1
Mcu.IPNb=44
Mcu.Name=STM32MP157FAAx
Mcu.Package=LFBGA448
Mcu.Pin0=PH5
Mcu.Pin1=PH4
Mcu.Pin10=DSIHOST_CKN
Mcu.Pin100=PD14
Mcu.Pin101=DDR_A1
Mcu.Pin102=DDR_RASN
Mcu.Pin103=DDR_WEN
Mcu.Pin104=DDR_CASN
Mcu.Pin105=PI8
Mcu.Pin106=PC13
Mcu.Pin107=DDR_A10
Mcu.Pin108=DDR_A12
Mcu.Pin109=DDR_CLKP
Mcu.Pin11=DSIHOST_D1N
Mcu.Pin110=DDR_CLKN
Mcu.Pin111=DDR_DQ8
Mcu.Pin112=PC14-OSC32_IN
Mcu.Pin113=PC15-OSC32_OUT
Mcu.Pin114=DDR_A14
Mcu.Pin115=DDR_A11
Mcu.Pin116=DDR_DQ10
Mcu.Pin117=PA14
Mcu.Pin118=DDR_BA1
Mcu.Pin119=DDR_CKE
Mcu.Pin12=DDR_DQ20
Mcu.Pin120=DDR_DQ13
Mcu.Pin121=DDR_DQ9
Mcu.Pin122=DDR_DQS1N
Mcu.Pin123=PH0-OSC_IN
Mcu.Pin124=PH1-OSC_OUT
Mcu.Pin125=DDR_A4
Mcu.Pin126=DDR_DQ11
Mcu.Pin127=DDR_DQM1
Mcu.Pin128=DDR_DQS1P
Mcu.Pin129=PC3
Mcu.Pin13=DDR_DQ23
Mcu.Pin130=PG3
Mcu.Pin131=PG5
Mcu.Pin132=PC0
Mcu.Pin133=PG11
Mcu.Pin134=DDR_A8
Mcu.Pin135=DDR_A6
Mcu.Pin136=DDR_DQ14
Mcu.Pin137=PA1
Mcu.Pin138=PF14
Mcu.Pin139=PB13
Mcu.Pin14=PH10
Mcu.Pin140=PF10
Mcu.Pin141=PB2
Mcu.Pin142=PD13
Mcu.Pin143=DDR_DQ12
Mcu.Pin144=DDR_DQ15
Mcu.Pin145=DDR_DQ24
Mcu.Pin146=PH7
Mcu.Pin147=PA13
Mcu.Pin148=PG0
Mcu.Pin149=PF15
Mcu.Pin15=PH11
Mcu.Pin150=PF13
Mcu.Pin151=PF11
Mcu.Pin152=PA6
Mcu.Pin153=PE7
Mcu.Pin154=PE9
Mcu.Pin155=PD12
Mcu.Pin156=PB6
Mcu.Pin157=PE10
Mcu.Pin158=PG9
Mcu.Pin159=PA12
Mcu.Pin16=PE14
Mcu.Pin160=DDR_DQ25
Mcu.Pin161=DDR_DQ31
Mcu.Pin162=DDR_DQ30
Mcu.Pin163=PC2
Mcu.Pin164=PE2
Mcu.Pin165=PG1
Mcu.Pin166=PB11
Mcu.Pin167=PH3
Mcu.Pin168=PA7
Mcu.Pin169=PG7
Mcu.Pin17=PD1
Mcu.Pin170=PE8
Mcu.Pin171=PA11
Mcu.Pin172=PA10
Mcu.Pin173=DDR_DQS3P
Mcu.Pin174=DDR_DQS3N
Mcu.Pin175=PG13
Mcu.Pin176=PG14
Mcu.Pin177=PA0
Mcu.Pin178=PB1
Mcu.Pin179=PC5
Mcu.Pin18=PD3
Mcu.Pin180=PB5
Mcu.Pin181=PG10
Mcu.Pin182=PF7
Mcu.Pin183=PF6
Mcu.Pin184=USB_DM2
Mcu.Pin185=USB_DP1
Mcu.Pin186=DDR_ATO
Mcu.Pin187=DDR_DQ29
Mcu.Pin188=DDR_DQ28
Mcu.Pin189=DDR_DQM3
Mcu.Pin19=PB15
Mcu.Pin190=PA2
Mcu.Pin191=PC1
Mcu.Pin192=PG4
Mcu.Pin193=PB0
Mcu.Pin194=PC4
Mcu.Pin195=PH2
Mcu.Pin196=PB8
Mcu.Pin197=PD11
Mcu.Pin198=PF8
Mcu.Pin199=PF9
Mcu.Pin2=PE13
Mcu.Pin20=PA8
Mcu.Pin200=USB_DP2
Mcu.Pin201=USB_DM1
Mcu.Pin202=DDR_VREF
Mcu.Pin203=DDR_DQ27
Mcu.Pin204=DDR_DQ26
Mcu.Pin205=VP_BSEC_VS_BSEC
Mcu.Pin206=VP_CRC1_VS_CRC
Mcu.Pin207=VP_CRYP1_VS_CRYP
Mcu.Pin208=VP_DDR_DDR3
Mcu.Pin209=VP_DDR_DDR_16_bits
Mcu.Pin21=DSIHOST_D0P
Mcu.Pin210=VP_DDR_DDR_32_bits
Mcu.Pin211=VP_DDR_DDR3_32_8Gb
Mcu.Pin212=VP_DTS_VS_DTS
Mcu.Pin213=VP_ETZPC_VS_ETZPC
Mcu.Pin214=VP_GPU_VS_GPU
Mcu.Pin215=VP_HASH1_VS_HASH
Mcu.Pin216=VP_HSEM_VS_HSEM
Mcu.Pin217=VP_IPCC_VS_IPCC
Mcu.Pin218=VP_IWDG1_VS_IWDG
Mcu.Pin219=VP_LTDC_DSIMode
Mcu.Pin22=DSIHOST_CKP
Mcu.Pin220=VP_OPENAMP_VS_OPENAMP
Mcu.Pin221=VP_RNG1_VS_RNG
Mcu.Pin222=VP_RTC_VS_RTC_Activate
Mcu.Pin223=VP_SYS_VS_Systick
Mcu.Pin224=VP_TAMP_VS_TAMP_Activate
Mcu.Pin225=VP_TIM6_VS_ClockSourceINT
Mcu.Pin226=VP_TIM15_VS_NoInput1
Mcu.Pin227=VP_DMA_VS_DMA1_A7NS
Mcu.Pin228=VP_DMA_VS_DMA2_A7NS
Mcu.Pin229=VP_MDMA_VS_MDMA_A7NS_8
Mcu.Pin23=DSIHOST_D1P
Mcu.Pin24=DDR_DQ19
Mcu.Pin25=DDR_DQ16
Mcu.Pin26=DDR_DQS2N
Mcu.Pin27=PH15
Mcu.Pin28=PH14
Mcu.Pin29=PE0
Mcu.Pin3=PD10
Mcu.Pin30=PD4
Mcu.Pin31=PD0
Mcu.Pin32=PE5
Mcu.Pin33=PB4
Mcu.Pin34=DDR_DQS2P
Mcu.Pin35=DDR_DQM2
Mcu.Pin36=PH13
Mcu.Pin37=PE11
Mcu.Pin38=PH8
Mcu.Pin39=PG6
Mcu.Pin4=PD5
Mcu.Pin40=PD2
Mcu.Pin41=PC7
Mcu.Pin42=PC9
Mcu.Pin43=PC11
Mcu.Pin44=DDR_DQ22
Mcu.Pin45=DDR_DQ17
Mcu.Pin46=DDR_DQ18
Mcu.Pin47=PI1
Mcu.Pin48=PI3
Mcu.Pin49=PE12
Mcu.Pin5=PE3
Mcu.Pin50=PH9
Mcu.Pin51=PE6
Mcu.Pin52=PA15
Mcu.Pin53=PC12
Mcu.Pin54=PC8
Mcu.Pin55=DDR_DQ3
Mcu.Pin56=DDR_DQ0
Mcu.Pin57=DDR_DQ21
Mcu.Pin58=PI7
Mcu.Pin59=PI5
Mcu.Pin6=PA9
Mcu.Pin60=PH12
Mcu.Pin61=PB7
Mcu.Pin62=PB9
Mcu.Pin63=PF2
Mcu.Pin64=PC10
Mcu.Pin65=PE4
Mcu.Pin66=DDR_A7
Mcu.Pin67=DDR_RESETN
Mcu.Pin68=DDR_DQ1
Mcu.Pin69=PZ4
Mcu.Pin7=PB3
Mcu.Pin70=PI6
Mcu.Pin71=DDR_A13
Mcu.Pin72=DDR_DQ7
Mcu.Pin73=DDR_DQM0
Mcu.Pin74=DDR_DQS0N
Mcu.Pin75=DDR_DQS0P
Mcu.Pin76=PZ5
Mcu.Pin77=DDR_A9
Mcu.Pin78=DDR_A5
Mcu.Pin79=DDR_DQ5
Mcu.Pin8=PB14
Mcu.Pin80=DDR_DQ2
Mcu.Pin81=DDR_DQ6
Mcu.Pin82=PG12
Mcu.Pin83=PI9
Mcu.Pin84=PI4
Mcu.Pin85=DDR_A2
Mcu.Pin86=DDR_A3
Mcu.Pin87=DDR_DQ4
Mcu.Pin88=DDR_BA2
Mcu.Pin89=DDR_A0
Mcu.Pin9=DSIHOST_D0N
Mcu.Pin90=DDR_BA0
Mcu.Pin91=DDR_DTO1
Mcu.Pin92=DDR_ZQ
Mcu.Pin93=PD15
Mcu.Pin94=PD6
Mcu.Pin95=DDR_CSN
Mcu.Pin96=DDR_ODT
Mcu.Pin97=DDR_DTO0
Mcu.Pin98=PD8
Mcu.Pin99=PD9
Mcu.PinsNb=230
Mcu.ThirdPartyNb=0
Mcu.UserConstants=
Mcu.UserName=STM32MP157FAAx
Mdma.MDMA_Channel16.FMC_DATA.0.BlockCount=0
Mdma.MDMA_Channel16.FMC_DATA.0.BlockDataLength=0
Mdma.MDMA_Channel16.FMC_DATA.0.BufferTransferLength=1
Mdma.MDMA_Channel16.FMC_DATA.0.CircularMode=MDMA_LINEAR_LIST
Mdma.MDMA_Channel16.FMC_DATA.0.DataAlignment=MDMA_DATAALIGN_PACKENABLE
Mdma.MDMA_Channel16.FMC_DATA.0.DestBlockAddressOffset=0
Mdma.MDMA_Channel16.FMC_DATA.0.DestBurst=MDMA_DEST_BURST_SINGLE
Mdma.MDMA_Channel16.FMC_DATA.0.DestDataSize=MDMA_DEST_DATASIZE_BYTE
Mdma.MDMA_Channel16.FMC_DATA.0.DestinationInc=MDMA_DEST_INC_BYTE
Mdma.MDMA_Channel16.FMC_DATA.0.DstAddress=0
Mdma.MDMA_Channel16.FMC_DATA.0.Endianness=MDMA_LITTLE_ENDIANNESS_PRESERVE
Mdma.MDMA_Channel16.FMC_DATA.0.Instance=MDMA_Channel16
Mdma.MDMA_Channel16.FMC_DATA.0.Mandatory=DISABLE
Mdma.MDMA_Channel16.FMC_DATA.0.MaskAddress=0
Mdma.MDMA_Channel16.FMC_DATA.0.MaskData=0
Mdma.MDMA_Channel16.FMC_DATA.0.Priority=MDMA_PRIORITY_LOW
Mdma.MDMA_Channel16.FMC_DATA.0.Rank=First
Mdma.MDMA_Channel16.FMC_DATA.0.RequestParameters=Instance,CircularMode,TransferTriggerMode,Priority,Endianness,SourceInc,DestinationInc,SourceDataSize,DestDataSize,DataAlignment,BufferTransferLength,SourceBurst,DestBurst,SourceBlockAddressOffset,DestBlockAddressOffset,MaskAddress,MaskData,SrcAddress,DstAddress,BlockDataLength,BlockCount,Rank,Mandatory
Mdma.MDMA_Channel16.FMC_DATA.0.SourceBlockAddressOffset=0
Mdma.MDMA_Channel16.FMC_DATA.0.SourceBurst=MDMA_SOURCE_BURST_SINGLE
Mdma.MDMA_Channel16.FMC_DATA.0.SourceDataSize=MDMA_SRC_DATASIZE_BYTE
Mdma.MDMA_Channel16.FMC_DATA.0.SourceInc=MDMA_SRC_INC_BYTE
Mdma.MDMA_Channel16.FMC_DATA.0.SrcAddress=0
Mdma.MDMA_Channel16.FMC_DATA.0.TransferTriggerMode=MDMA_BUFFER_TRANSFER
Mdma.MDMA_Channel16.Request0=FMC_DATA
Mdma.MDMA_Channel16.RequestsNb=1
Mdma.MDMA_Channel17.FMC_ERROR.0.BlockCount=0
Mdma.MDMA_Channel17.FMC_ERROR.0.BlockDataLength=0
Mdma.MDMA_Channel17.FMC_ERROR.0.BufferTransferLength=1
Mdma.MDMA_Channel17.FMC_ERROR.0.CircularMode=MDMA_LINEAR_LIST
Mdma.MDMA_Channel17.FMC_ERROR.0.DataAlignment=MDMA_DATAALIGN_PACKENABLE
Mdma.MDMA_Channel17.FMC_ERROR.0.DestBlockAddressOffset=0
Mdma.MDMA_Channel17.FMC_ERROR.0.DestBurst=MDMA_DEST_BURST_SINGLE
Mdma.MDMA_Channel17.FMC_ERROR.0.DestDataSize=MDMA_DEST_DATASIZE_BYTE
Mdma.MDMA_Channel17.FMC_ERROR.0.DestinationInc=MDMA_DEST_INC_BYTE
Mdma.MDMA_Channel17.FMC_ERROR.0.DstAddress=0
Mdma.MDMA_Channel17.FMC_ERROR.0.Endianness=MDMA_LITTLE_ENDIANNESS_PRESERVE
Mdma.MDMA_Channel17.FMC_ERROR.0.Instance=MDMA_Channel17
Mdma.MDMA_Channel17.FMC_ERROR.0.Mandatory=DISABLE
Mdma.MDMA_Channel17.FMC_ERROR.0.MaskAddress=0
Mdma.MDMA_Channel17.FMC_ERROR.0.MaskData=0
Mdma.MDMA_Channel17.FMC_ERROR.0.Priority=MDMA_PRIORITY_LOW
Mdma.MDMA_Channel17.FMC_ERROR.0.Rank=First
Mdma.MDMA_Channel17.FMC_ERROR.0.RequestParameters=Instance,CircularMode,TransferTriggerMode,Priority,Endianness,SourceInc,DestinationInc,SourceDataSize,DestDataSize,DataAlignment,BufferTransferLength,SourceBurst,DestBurst,SourceBlockAddressOffset,DestBlockAddressOffset,MaskAddress,MaskData,SrcAddress,DstAddress,BlockDataLength,BlockCount,Rank,Mandatory
Mdma.MDMA_Channel17.FMC_ERROR.0.SourceBlockAddressOffset=0
Mdma.MDMA_Channel17.FMC_ERROR.0.SourceBurst=MDMA_SOURCE_BURST_SINGLE
Mdma.MDMA_Channel17.FMC_ERROR.0.SourceDataSize=MDMA_SRC_DATASIZE_BYTE
Mdma.MDMA_Channel17.FMC_ERROR.0.SourceInc=MDMA_SRC_INC_BYTE
