STMicroelectronics/STM32_open_pin_data/boards/M10_Evaluation_Board_STM32MP157F-EV1_STM32MP157FAA_Board_AllConfig.ioc
Mdma.MDMA_Channel17.FMC_ERROR.0.SrcAddress=0
Mdma.MDMA_Channel17.FMC_ERROR.0.TransferTriggerMode=MDMA_BUFFER_TRANSFER
Mdma.MDMA_Channel17.Request0=FMC_ERROR
Mdma.MDMA_Channel17.RequestsNb=1
Mdma.MDMA_Channel18.HASH1_IN.0.BlockCount=0
Mdma.MDMA_Channel18.HASH1_IN.0.BlockDataLength=0
Mdma.MDMA_Channel18.HASH1_IN.0.BufferTransferLength=1
Mdma.MDMA_Channel18.HASH1_IN.0.CircularMode=MDMA_LINEAR_LIST
Mdma.MDMA_Channel18.HASH1_IN.0.DataAlignment=MDMA_DATAALIGN_PACKENABLE
Mdma.MDMA_Channel18.HASH1_IN.0.DestBlockAddressOffset=0
Mdma.MDMA_Channel18.HASH1_IN.0.DestBurst=MDMA_DEST_BURST_SINGLE
Mdma.MDMA_Channel18.HASH1_IN.0.DestDataSize=MDMA_DEST_DATASIZE_BYTE
Mdma.MDMA_Channel18.HASH1_IN.0.DestinationInc=MDMA_DEST_INC_BYTE
Mdma.MDMA_Channel18.HASH1_IN.0.DstAddress=0
Mdma.MDMA_Channel18.HASH1_IN.0.Endianness=MDMA_LITTLE_ENDIANNESS_PRESERVE
Mdma.MDMA_Channel18.HASH1_IN.0.Instance=MDMA_Channel18
Mdma.MDMA_Channel18.HASH1_IN.0.Mandatory=DISABLE
Mdma.MDMA_Channel18.HASH1_IN.0.MaskAddress=0
Mdma.MDMA_Channel18.HASH1_IN.0.MaskData=0
Mdma.MDMA_Channel18.HASH1_IN.0.Priority=MDMA_PRIORITY_LOW
Mdma.MDMA_Channel18.HASH1_IN.0.Rank=First
Mdma.MDMA_Channel18.HASH1_IN.0.RequestParameters=Instance,CircularMode,TransferTriggerMode,Priority,Endianness,SourceInc,DestinationInc,SourceDataSize,DestDataSize,DataAlignment,BufferTransferLength,SourceBurst,DestBurst,SourceBlockAddressOffset,DestBlockAddressOffset,MaskAddress,MaskData,SrcAddress,DstAddress,BlockDataLength,BlockCount,Rank,Mandatory
Mdma.MDMA_Channel18.HASH1_IN.0.SourceBlockAddressOffset=0
Mdma.MDMA_Channel18.HASH1_IN.0.SourceBurst=MDMA_SOURCE_BURST_SINGLE
Mdma.MDMA_Channel18.HASH1_IN.0.SourceDataSize=MDMA_SRC_DATASIZE_BYTE
Mdma.MDMA_Channel18.HASH1_IN.0.SourceInc=MDMA_SRC_INC_BYTE
Mdma.MDMA_Channel18.HASH1_IN.0.SrcAddress=0
Mdma.MDMA_Channel18.HASH1_IN.0.TransferTriggerMode=MDMA_BUFFER_TRANSFER
Mdma.MDMA_Channel18.Request0=HASH1_IN
Mdma.MDMA_Channel18.RequestsNb=1
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.BlockCount=0
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.BlockDataLength=0
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.BufferTransferLength=1
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.CircularMode=MDMA_LINEAR_LIST
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.DataAlignment=MDMA_DATAALIGN_PACKENABLE
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.DestBlockAddressOffset=0
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.DestBurst=MDMA_DEST_BURST_SINGLE
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.DestDataSize=MDMA_DEST_DATASIZE_BYTE
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.DestinationInc=MDMA_DEST_INC_DISABLE
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.DstAddress=0
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.Endianness=MDMA_LITTLE_ENDIANNESS_PRESERVE
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.Instance=MDMA_Channel19
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.Mandatory=DISABLE
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.MaskAddress=0
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.MaskData=0
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.Priority=MDMA_PRIORITY_LOW
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.Rank=First
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.RequestParameters=Instance,CircularMode,TransferTriggerMode,Priority,Endianness,SourceInc,DestinationInc,SourceDataSize,DestDataSize,DataAlignment,BufferTransferLength,SourceBurst,DestBurst,SourceBlockAddressOffset,DestBlockAddressOffset,MaskAddress,MaskData,SrcAddress,DstAddress,BlockDataLength,BlockCount,Rank,Mandatory
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.SourceBlockAddressOffset=0
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.SourceBurst=MDMA_SOURCE_BURST_SINGLE
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.SourceDataSize=MDMA_SRC_DATASIZE_BYTE
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.SourceInc=MDMA_SRC_INC_BYTE
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.SrcAddress=0
Mdma.MDMA_Channel19.QUADSPI_FIFO_TH.0.TransferTriggerMode=MDMA_BUFFER_TRANSFER
Mdma.MDMA_Channel19.Request0=QUADSPI_FIFO_TH
Mdma.MDMA_Channel19.RequestsNb=1
Mdma.RequestSet0=MDMA_Channel16
Mdma.RequestSet1=MDMA_Channel17
Mdma.RequestSet2=MDMA_Channel18
Mdma.RequestSet3=MDMA_Channel19
Mdma.RequestSetsNb=4
MxCube.Version=6.13.0
MxDb.Version=DB.6.0.130
NVIC.BusFault_IRQn=true\:1\:0\:true\:false\:true\:false\:false\:false
NVIC.DebugMonitor_IRQn=true\:1\:0\:true\:false\:true\:false\:false\:false
NVIC.ForceEnableDMAVector=true
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.IPCC_RX1_IRQn=true\:1\:0\:true\:false\:true\:true\:true\:true
NVIC.IPCC_TX1_IRQn=true\:1\:0\:true\:false\:true\:true\:true\:true
NVIC.MemoryManagement_IRQn=true\:1\:0\:true\:false\:true\:false\:false\:false
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.PendSV_IRQn=true\:1\:0\:true\:false\:true\:false\:false\:false
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
NVIC.RCC_WAKEUP_IRQn=true\:0\:0\:false\:false\:true\:false\:true\:true
NVIC.SVCall_IRQn=true\:1\:0\:true\:false\:true\:false\:false\:false
NVIC.SysTick_IRQn=true\:1\:0\:true\:false\:true\:false\:true\:false
NVIC.UsageFault_IRQn=true\:1\:0\:true\:false\:true\:false\:false\:false
PA0.GPIOParameters=PinAttribute
PA0.Locked=true
PA0.Mode=WakeUp1
PA0.PinAttribute=CortexA7S,CortexA7NS,CortexM4
PA0.Signal=PWR_WKUP1
PA1.GPIOParameters=GPIO_Label,PinAttribute
PA1.GPIO_Label=ETH_RX_CLK [RTL8211EG_RXCLK]
PA1.Locked=true
PA1.Mode=RGMII (Reduced GMII)
PA1.PinAttribute=CortexA7NS
PA1.Signal=ETH1_RX_CLK
PA10.GPIOParameters=GPIO_Label,PinAttribute
PA10.GPIO_Label=OTG_ID [ECMF02-4CMX8_ID]
PA10.Locked=true
PA10.Mode=Ext_Phy_OTG/Dual-Role-Device
PA10.PinAttribute=BootROM,BootLoader,CortexA7NS
PA10.Signal=USB_OTG_HS_ID
PA11.GPIOParameters=PinAttribute
PA11.Mode=I2C
PA11.PinAttribute=CortexA7NS
PA11.Signal=I2C5_SCL
PA12.GPIOParameters=PinAttribute
PA12.Locked=true
PA12.Mode=I2C
PA12.PinAttribute=CortexA7NS
PA12.Signal=I2C5_SDA
PA13.GPIOParameters=GPIO_Label,PinAttribute
PA13.GPIO_Label=PA13 [ST3241EBPR_T2IN]
PA13.Locked=true
PA13.PinAttribute=Free
PA13.Signal=GPIO_Input
PA14.GPIOParameters=GPIO_Label,PinAttribute
PA14.GPIO_Label=PA14
PA14.Locked=true
PA14.PinAttribute=Free
PA14.Signal=GPIO_Input
PA15.GPIOParameters=PinAttribute
PA15.Mode=CEC_Activate
PA15.PinAttribute=CortexA7NS
PA15.Signal=CEC
PA2.GPIOParameters=GPIO_Label,PinAttribute
PA2.GPIO_Label=ETH_MDIO [RTL8211EG_MDIO]
PA2.Locked=true
PA2.Mode=RGMII (Reduced GMII)
PA2.PinAttribute=CortexA7NS
PA2.Signal=ETH1_MDIO
PA6.GPIOParameters=GPIO_Label,PinAttribute
PA6.GPIO_Label=PAR_PCLK [FPC05024_PCLK]
PA6.Locked=true
PA6.Mode=Slave_12_bits_External_Synchro
PA6.PinAttribute=CortexA7NS
PA6.Signal=DCMI_PIXCLK
PA7.GPIOParameters=GPIO_Label,PinAttribute
PA7.GPIO_Label=ETH_RX_DV [RTL8211EG_RXDV_PHY_AD2]
PA7.Locked=true
PA7.Mode=RGMII (Reduced GMII)
PA7.PinAttribute=CortexA7NS
PA7.Signal=ETH1_RX_CTL
PA8.GPIOParameters=GPIO_PuPd,GPIO_Label,PinAttribute
PA8.GPIO_Label=eMMC_SDIO2_D4 [THGBMDG5D1LBAIL_DAT4]
PA8.GPIO_PuPd=GPIO_PULLUP
PA8.Locked=true
PA8.Mode=mmc_8_bits_Wide_bus
PA8.PinAttribute=BootROM,BootLoader,CortexA7NS
PA8.Signal=SDMMC2_D4
PA9.GPIOParameters=GPIO_PuPd,GPIO_Label,PinAttribute
PA9.GPIO_Label=eMMC_SDIO2_D5 [THGBMDG5D1LBAIL_DAT5]
PA9.GPIO_PuPd=GPIO_PULLUP
PA9.Locked=true
PA9.Mode=mmc_8_bits_Wide_bus
PA9.PinAttribute=BootROM,BootLoader,CortexA7NS
PA9.Signal=SDMMC2_D5
PB0.GPIOParameters=GPIO_Label,PinAttribute
PB0.GPIO_Label=ETH_RXD2 [RTL8211EG_RXD2]
PB0.Locked=true
PB0.Mode=RGMII (Reduced GMII)
PB0.PinAttribute=CortexA7NS
PB0.Signal=ETH1_RXD2
PB1.GPIOParameters=GPIO_Label,PinAttribute
PB1.GPIO_Label=ETH_RXD3 [RTL8211EG_RXD3]
PB1.Locked=true
PB1.Mode=RGMII (Reduced GMII)
PB1.PinAttribute=CortexA7NS
PB1.Signal=ETH1_RXD3
PB11.GPIOParameters=GPIO_Label,PinAttribute
PB11.GPIO_Label=ETH_TX_EN [RTL8211EG_TXEN]
PB11.Locked=true
PB11.Mode=RGMII (Reduced GMII)
PB11.PinAttribute=CortexA7NS
PB11.Signal=ETH1_TX_CTL
PB13.GPIOParameters=PinAttribute
PB13.Locked=true
PB13.PinAttribute=CortexA7NS
PB13.Signal=S_CKOUTDFSDM1
PB14.GPIOParameters=GPIO_PuPd,GPIO_Label,PinAttribute
PB14.GPIO_Label=eMMC_SDIO2_D0 [THGBMDG5D1LBAIL_DAT0]
PB14.GPIO_PuPd=GPIO_PULLUP
PB14.Locked=true
PB14.Mode=mmc_8_bits_Wide_bus
PB14.PinAttribute=BootROM,BootLoader,CortexA7NS
PB14.Signal=SDMMC2_D0
PB15.GPIOParameters=GPIO_PuPd,GPIO_Label,PinAttribute
PB15.GPIO_Label=eMMC_SDIO2_D1 [THGBMDG5D1LBAIL_DAT1]
PB15.GPIO_PuPd=GPIO_PULLUP
PB15.Locked=true
PB15.Mode=mmc_8_bits_Wide_bus
PB15.PinAttribute=BootROM,BootLoader,CortexA7NS
PB15.Signal=SDMMC2_D1
PB2.GPIOParameters=GPIO_Label,PinAttribute
PB2.GPIO_Label=RS232_RX [ST3241EBPR_R3OUT]
PB2.Locked=true
PB2.Mode=Asynchronous
PB2.PinAttribute=BootROM,BootLoader,CortexA7NS
PB2.Signal=UART4_RX
PB3.GPIOParameters=GPIO_PuPd,GPIO_Label,PinAttribute
PB3.GPIO_Label=eMMC_SDIO2_D2 [THGBMDG5D1LBAIL_DAT2]
PB3.GPIO_PuPd=GPIO_PULLUP
PB3.Locked=true
PB3.Mode=mmc_8_bits_Wide_bus
PB3.PinAttribute=BootROM,BootLoader,CortexA7NS
PB3.Signal=SDMMC2_D2
PB4.GPIOParameters=GPIO_PuPd,GPIO_Label,PinAttribute
PB4.GPIO_Label=eMMC_SDIO2_D3 [THGBMDG5D1LBAIL_DAT3]
PB4.GPIO_PuPd=GPIO_PULLUP
PB4.Locked=true
PB4.Mode=mmc_8_bits_Wide_bus
PB4.PinAttribute=BootROM,BootLoader,CortexA7NS
PB4.Signal=SDMMC2_D3
PB5.GPIOParameters=PinAttribute
PB5.Locked=true
PB5.Mode=SAI_A_SPDIF
PB5.PinAttribute=CortexA7NS
PB5.Signal=SAI4_SD_A
PB6.GPIOParameters=GPIO_PuPd,GPIO_Label,PinAttribute
PB6.GPIO_Label=QSPI_BK1_NCS [MX25L51245G_CS]
PB6.GPIO_PuPd=GPIO_PULLUP
PB6.Locked=true
PB6.Mode=Enable Chip Select for each bank
PB6.PinAttribute=BootROM,BootLoader,CortexA7NS
PB6.Signal=QUADSPI_BK1_NCS
PB7.GPIOParameters=GPIO_Label,PinAttribute
PB7.GPIO_Label=PAR_VSYNC [FPC05024_VSYNC]
PB7.Locked=true
PB7.Mode=Slave_12_bits_External_Synchro
PB7.PinAttribute=CortexA7NS
PB7.Signal=DCMI_VSYNC
PB8.GPIOParameters=GPIO_Label,PinAttribute
PB8.GPIO_Label=PAR_D6 [FPC05024_D8]
PB8.Locked=true
PB8.Mode=Slave_12_bits_External_Synchro
PB8.PinAttribute=CortexA7NS
PB8.Signal=DCMI_D6
PB9.GPIOParameters=GPIO_PuPd,GPIO_Label,PinAttribute
PB9.GPIO_Label=SDMMC1_CDIR [IP4856CX25_DIR_CMD]
PB9.GPIO_PuPd=GPIO_PULLUP
PB9.Locked=true
PB9.Mode=SD_4_bits_Wide_bus_dir_voltage_converter
PB9.PinAttribute=BootROM,BootLoader,CortexA7NS
PB9.Signal=SDMMC1_CDIR
PC0.GPIOParameters=GPIO_PuPd,GPIO_Label,PinAttribute
PC0.GPIO_Label=QSPI_BK2_NCS [MX25L51245G_CS]
PC0.GPIO_PuPd=GPIO_PULLUP
PC0.Locked=true
PC0.Mode=Enable Chip Select for each bank
PC0.PinAttribute=BootROM,BootLoader,CortexA7NS
PC0.Signal=QUADSPI_BK2_NCS
PC1.GPIOParameters=GPIO_Label,PinAttribute
PC1.GPIO_Label=ETH_MDC [RTL8211EG_MDC]
PC1.Locked=true
PC1.Mode=RGMII (Reduced GMII)
PC1.PinAttribute=CortexA7NS
PC1.Signal=ETH1_MDC
PC10.GPIOParameters=GPIO_Label,PinAttribute
PC10.GPIO_Label=SDMMC1_D2 [IP4856CX25_DATA2_H]
PC10.Locked=true
PC10.Mode=SD_4_bits_Wide_bus_dir_voltage_converter
PC10.PinAttribute=BootROM,BootLoader,CortexA7NS
PC10.Signal=SDMMC1_D2
PC11.GPIOParameters=GPIO_Label,PinAttribute
PC11.GPIO_Label=SDMMC1_D3 [IP4856CX25_DATA3_H]
PC11.Locked=true
PC11.Mode=SD_4_bits_Wide_bus_dir_voltage_converter
PC11.PinAttribute=BootROM,BootLoader,CortexA7NS
PC11.Signal=SDMMC1_D3
PC12.GPIOParameters=GPIO_Speed_High_Default,GPIO_Label,PinAttribute
PC12.GPIO_Label=SDMMC1_CK [IP4856CX25_CLK_IN]
PC12.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_HIGH
PC12.Locked=true
PC12.Mode=SD_4_bits_Wide_bus_dir_voltage_converter
PC12.PinAttribute=BootROM,BootLoader,CortexA7NS
PC12.Signal=SDMMC1_CK
PC13.GPIOParameters=GPIO_Label,PinAttribute
PC13.GPIO_Label=PMIC_WAKEUP [STPMIC1A_WAKEUP]
PC13.Locked=true
PC13.PinAttribute=Free
PC13.Signal=GPIO_Output
PC14-OSC32_IN.GPIOParameters=PinAttribute
PC14-OSC32_IN.Locked=true
PC14-OSC32_IN.Mode=LSE-External-Oscillator
PC14-OSC32_IN.PinAttribute=BootROM,BootLoader,CortexA7S,CortexA7NS,CortexM4
PC14-OSC32_IN.Signal=RCC_OSC32_IN
PC15-OSC32_OUT.GPIOParameters=PinAttribute
PC15-OSC32_OUT.Locked=true
PC15-OSC32_OUT.Mode=LSE-External-Oscillator
PC15-OSC32_OUT.PinAttribute=BootROM,BootLoader,CortexA7S,CortexA7NS,CortexM4
PC15-OSC32_OUT.Signal=RCC_OSC32_OUT
PC2.GPIOParameters=GPIO_Label,PinAttribute
PC2.GPIO_Label=ETH_TXD2 [RTL8211EG_TXD2]
PC2.Locked=true
PC2.Mode=RGMII (Reduced GMII)
PC2.PinAttribute=CortexA7NS
PC2.Signal=ETH1_TXD2
PC3.GPIOParameters=PinAttribute
PC3.Locked=true
PC3.PinAttribute=CortexA7NS
PC3.Signal=S_DATAIN1DFSDM1
PC4.GPIOParameters=GPIO_Label,PinAttribute
PC4.GPIO_Label=ETH_RXD0 [RTL8211EG_RXD0]
PC4.Locked=true
PC4.Mode=RGMII (Reduced GMII)
PC4.PinAttribute=CortexA7NS
PC4.Signal=ETH1_RXD0
PC5.GPIOParameters=GPIO_Label,PinAttribute
PC5.GPIO_Label=ETH_RXD1 [RTL8211EG_RXD1]
PC5.Locked=true
PC5.Mode=RGMII (Reduced GMII)
PC5.PinAttribute=CortexA7NS
PC5.Signal=ETH1_RXD1
PC7.GPIOParameters=GPIO_PuPd,GPIO_Label,PinAttribute
PC7.GPIO_Label=SDMMC1_D123DIR [IP4856CX25_DIR_1_3]
PC7.GPIO_PuPd=GPIO_PULLUP
PC7.Locked=true
PC7.Mode=SD_4_bits_Wide_bus_dir_voltage_converter
PC7.PinAttribute=BootROM,BootLoader,CortexA7NS
PC7.Signal=SDMMC1_D123DIR
PC8.GPIOParameters=GPIO_Label,PinAttribute
PC8.GPIO_Label=SDMMC1_D0 [IP4856CX25_DATA0_H]
PC8.Locked=true
PC8.Mode=SD_4_bits_Wide_bus_dir_voltage_converter
PC8.PinAttribute=BootROM,BootLoader,CortexA7NS
PC8.Signal=SDMMC1_D0
PC9.GPIOParameters=GPIO_Label,PinAttribute
PC9.GPIO_Label=SDMMC1_D1 [IP4856CX25_DATA1_H]
PC9.Locked=true
PC9.Mode=SD_4_bits_Wide_bus_dir_voltage_converter
PC9.PinAttribute=BootROM,BootLoader,CortexA7NS
PC9.Signal=SDMMC1_D1
PD0.GPIOParameters=GPIO_Speed_High_Default,PinAttribute
PD0.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_HIGH
PD0.Locked=true
PD0.PinAttribute=BootROM,BootLoader,CortexA7NS
PD0.Signal=FMC_D2_DA2
PD1.GPIOParameters=GPIO_Speed_High_Default,PinAttribute
PD1.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_HIGH
PD1.Locked=true
PD1.PinAttribute=BootROM,BootLoader,CortexA7NS
PD1.Signal=FMC_D3_DA3
PD10.GPIOParameters=GPIO_Label,PinAttribute
PD10.GPIO_Label=SUB_NRST
PD10.Locked=true
PD10.PinAttribute=Free
PD10.Signal=GPIO_Output
PD11.GPIOParameters=GPIO_Speed_High_Default,PinAttribute
PD11.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_HIGH
PD11.Locked=true
PD11.PinAttribute=BootROM,BootLoader,CortexA7NS
PD11.Signal=FMC_A16_CLE
PD12.GPIOParameters=GPIO_Speed_High_Default,PinAttribute
PD12.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_HIGH
PD12.Locked=true
PD12.PinAttribute=BootROM,BootLoader,CortexA7NS
PD12.Signal=FMC_A17_ALE
PD13.GPIOParameters=GPIO_Label,PinAttribute
PD13.GPIO_Label=DSI_PWM [NCP5006SNT1G_FB]
PD13.Locked=true
PD13.PinAttribute=Free
PD13.Signal=GPIO_Output
PD14.GPIOParameters=GPIO_Speed_High_Default,PinAttribute
PD14.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_HIGH
PD14.Locked=true
PD14.PinAttribute=BootROM,BootLoader,CortexA7NS
PD14.Signal=FMC_D0_DA0
PD15.GPIOParameters=GPIO_Speed_High_Default,PinAttribute
PD15.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_HIGH
PD15.Locked=true
PD15.PinAttribute=BootROM,BootLoader,CortexA7NS
PD15.Signal=FMC_D1_DA1
PD2.GPIOParameters=GPIO_Label,PinAttribute
PD2.GPIO_Label=SDMMC1_CMD [IP4856CX25_CMD_H]
PD2.Locked=true
PD2.Mode=SD_4_bits_Wide_bus_dir_voltage_converter
PD2.PinAttribute=BootROM,BootLoader,CortexA7NS
PD2.Signal=SDMMC1_CMD
PD3.GPIOParameters=GPIO_PuPd,GPIO_Label,PinAttribute
PD3.GPIO_Label=eMMC_SDIO2_D7 [THGBMDG5D1LBAIL_DAT7]
PD3.GPIO_PuPd=GPIO_PULLUP
PD3.Locked=true
PD3.Mode=mmc_8_bits_Wide_bus
PD3.PinAttribute=BootROM,BootLoader,CortexA7NS
PD3.Signal=SDMMC2_D7
PD4.GPIOParameters=GPIO_Speed_High_Default,PinAttribute
PD4.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_HIGH
PD4.Locked=true
PD4.PinAttribute=BootROM,BootLoader,CortexA7NS
PD4.Signal=FMC_NOE
PD5.GPIOParameters=GPIO_Speed_High_Default,PinAttribute
PD5.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_HIGH
PD5.Locked=true
PD5.PinAttribute=BootROM,BootLoader,CortexA7NS
PD5.Signal=FMC_NWE
PD6.GPIOParameters=GPIO_PuPd,PinAttribute
PD6.GPIO_PuPd=GPIO_PULLUP
PD6.Locked=true
PD6.PinAttribute=BootROM,BootLoader,CortexA7NS
PD6.Signal=FMC_NWAIT
PD8.GPIOParameters=GPIO_Label,PinAttribute
PD8.GPIO_Label=LED_O [LD4_ORANGE]
PD8.Locked=true
PD8.PinAttribute=Free
PD8.Signal=GPIO_Output
PD9.GPIOParameters=GPIO_Label,PinAttribute
PD9.GPIO_Label=LED_B [LD5_BLUE]
PD9.Locked=true
PD9.PinAttribute=Free
PD9.Signal=GPIO_Output
PE0.GPIOParameters=GPIO_Label,PinAttribute
PE0.GPIO_Label=SAI2_MCLKA [WM8994ECS_MCLK1]
PE0.Locked=true
PE0.Mode=SAI_A_MasterWithClock
PE0.PinAttribute=CortexA7NS
PE0.Signal=SAI2_MCLK_A
PE10.GPIOParameters=GPIO_Speed_High_Default,PinAttribute
PE10.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_HIGH
PE10.Locked=true
PE10.PinAttribute=BootROM,BootLoader,CortexA7NS
PE10.Signal=FMC_D7_DA7
PE11.GPIOParameters=GPIO_Label,GPIO_ModeDefaultOutputPP,PinAttribute
PE11.GPIO_Label=uSD_LDS_EN [IP4856CX25_ENABLE]
PE11.GPIO_ModeDefaultOutputPP=GPIO_MODE_OUTPUT_OD
PE11.Locked=true
PE11.PinAttribute=Free
PE11.Signal=GPIO_Output
PE12.GPIOParameters=GPIO_Label,PinAttribute
PE12.GPIO_Label=SAI2_SCKB [WM8994ECS_BCLK2]
PE12.Locked=true
PE12.Mode=SAI_B_MasterWithClock
PE12.PinAttribute=CortexA7NS
PE12.Signal=SAI2_SCK_B
PE13.GPIOParameters=GPIO_Label,PinAttribute
PE13.GPIO_Label=SAI2_FSB [WM8994ECS_LRCLK2]
PE13.Locked=true
PE13.Mode=SAI_B_MasterWithClock
PE13.PinAttribute=CortexA7NS
PE13.Signal=SAI2_FS_B
PE14.GPIOParameters=GPIO_Label,PinAttribute
PE14.GPIO_Label=SAI2_MCLKB [WM8994ECS_MCLK2]
PE14.Locked=true
PE14.Mode=SAI_B_MasterWithClock
PE14.PinAttribute=CortexA7NS
PE14.Signal=SAI2_MCLK_B
PE2.GPIOParameters=GPIO_Label,PinAttribute
PE2.GPIO_Label=ETH_TXD3 [RTL8211EG_TXD3]
PE2.Locked=true
PE2.Mode=RGMII (Reduced GMII)
PE2.PinAttribute=CortexA7NS
PE2.Signal=ETH1_TXD3
PE3.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,GPIO_Label,PinAttribute
PE3.GPIO_Label=eMMC_SDIO2_CK [THGBMDG5D1LBAIL_CLK]
PE3.GPIO_PuPd=GPIO_PULLUP
PE3.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_HIGH
PE3.Locked=true
PE3.Mode=mmc_8_bits_Wide_bus
PE3.PinAttribute=BootROM,BootLoader,CortexA7NS
PE3.Signal=SDMMC2_CK
PE4.GPIOParameters=GPIO_PuPd,GPIO_Label,PinAttribute
PE4.GPIO_Label=SDMMC1_CKIN [IP4856CX25_CLK_FB]
PE4.GPIO_PuPd=GPIO_PULLUP
PE4.Locked=true
PE4.Mode=SD_4_bits_Wide_bus_dir_voltage_converter
PE4.PinAttribute=BootROM,BootLoader,CortexA7NS
PE4.Signal=SDMMC1_CKIN
PE5.GPIOParameters=GPIO_PuPd,GPIO_Label,PinAttribute
PE5.GPIO_Label=eMMC_SDIO2_D6 [THGBMDG5D1LBAIL_DAT6]
PE5.GPIO_PuPd=GPIO_PULLUP
PE5.Locked=true
PE5.Mode=mmc_8_bits_Wide_bus
PE5.PinAttribute=BootROM,BootLoader,CortexA7NS
