STMicroelectronics/STM32_open_pin_data/boards/M10_Evaluation_Board_STM32MP157F-EV1_STM32MP157FAA_Board_AllConfig.ioc
PE5.Signal=SDMMC2_D6
PE6.GPIOParameters=GPIO_Label,PinAttribute
PE6.GPIO_Label=PAR_D7 [FPC05024_D9]
PE6.Locked=true
PE6.Mode=Slave_12_bits_External_Synchro
PE6.PinAttribute=CortexA7NS
PE6.Signal=DCMI_D7
PE7.GPIOParameters=GPIO_Speed_High_Default,PinAttribute
PE7.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_HIGH
PE7.Locked=true
PE7.PinAttribute=BootROM,BootLoader,CortexA7NS
PE7.Signal=FMC_D4_DA4
PE8.GPIOParameters=GPIO_Speed_High_Default,PinAttribute
PE8.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_HIGH
PE8.Locked=true
PE8.PinAttribute=BootROM,BootLoader,CortexA7NS
PE8.Signal=FMC_D5_DA5
PE9.GPIOParameters=GPIO_Speed_High_Default,PinAttribute
PE9.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_HIGH
PE9.Locked=true
PE9.PinAttribute=BootROM,BootLoader,CortexA7NS
PE9.Signal=FMC_D6_DA6
PF10.GPIOParameters=GPIO_Label,GPIO_Speed_High_ByDefault,GPIO_Speed_Medium_Default,PinAttribute
PF10.GPIO_Label=QSPI_CLK [MX25L51245G_SCLK]
PF10.GPIO_Speed_High_ByDefault=GPIO_SPEED_FREQ_VERY_HIGH
PF10.GPIO_Speed_Medium_Default=GPIO_SPEED_FREQ_VERY_HIGH
PF10.Locked=true
PF10.Mode=Dual Bank
PF10.PinAttribute=BootROM,BootLoader,CortexA7NS
PF10.Signal=QUADSPI_CLK
PF11.GPIOParameters=GPIO_Label,PinAttribute
PF11.GPIO_Label=SAI2_SDB [WM8994ECS_ADCDAT1]
PF11.Locked=true
PF11.Mode=SAI_B_MasterWithClock
PF11.PinAttribute=CortexA7NS
PF11.Signal=SAI2_SD_B
PF13.GPIOParameters=PinAttribute
PF13.Locked=true
PF13.PinAttribute=CortexA7NS
PF13.Signal=S_DATAIN3DFSDM1
PF14.GPIOParameters=GPIO_Label,PinAttribute
PF14.GPIO_Label=uSD_LDO_SEL [IP4856CX25_SEL]
PF14.Locked=true
PF14.PinAttribute=Free
PF14.Signal=GPIO_Output
PF15.GPIOParameters=GPIO_Label,PinAttribute
PF15.GPIO_Label=DSI_RESET
PF15.Locked=true
PF15.PinAttribute=Free
PF15.Signal=GPIO_Output
PF2.GPIOParameters=GPIO_PuPd,GPIO_Label,PinAttribute
PF2.GPIO_Label=SDMMC1_D0DIR [IP4856CX25_DIR_0]
PF2.GPIO_PuPd=GPIO_PULLUP
PF2.Locked=true
PF2.Mode=SD_4_bits_Wide_bus_dir_voltage_converter
PF2.PinAttribute=BootROM,BootLoader,CortexA7NS
PF2.Signal=SDMMC1_D0DIR
PF6.GPIOParameters=GPIO_Label,PinAttribute
PF6.GPIO_Label=QSPI_BK1_IO3 [MX25L51245G_SIO3]
PF6.Locked=true
PF6.Mode=Dual Bank
PF6.PinAttribute=BootROM,BootLoader,CortexA7NS
PF6.Signal=QUADSPI_BK1_IO3
PF7.GPIOParameters=GPIO_Label,PinAttribute
PF7.GPIO_Label=QSPI_BK1_IO2 [MX25L51245G_SIO2]
PF7.Locked=true
PF7.Mode=Dual Bank
PF7.PinAttribute=BootROM,BootLoader,CortexA7NS
PF7.Signal=QUADSPI_BK1_IO2
PF8.GPIOParameters=GPIO_Label,PinAttribute
PF8.GPIO_Label=QSPI_BK1_IO0 [MX25L51245G_SIO0]
PF8.Locked=true
PF8.Mode=Dual Bank
PF8.PinAttribute=BootROM,BootLoader,CortexA7NS
PF8.Signal=QUADSPI_BK1_IO0
PF9.GPIOParameters=GPIO_Label,PinAttribute
PF9.GPIO_Label=QSPI_BK1_IO1 [MX25L51245G_SIO1]
PF9.Locked=true
PF9.Mode=Dual Bank
PF9.PinAttribute=BootROM,BootLoader,CortexA7NS
PF9.Signal=QUADSPI_BK1_IO1
PG0.GPIOParameters=GPIO_Label,PinAttribute
PG0.GPIO_Label=ETH_MDINT [RTL8211EG_INT]
PG0.Locked=true
PG0.PinAttribute=Free
PG0.Signal=GPIO_Input
PG1.GPIOParameters=GPIO_PuPd,GPIO_Label,PinAttribute
PG1.GPIO_Label=uSD_DETECT  [IP4856CX25_CD]
PG1.GPIO_PuPd=GPIO_PULLUP
PG1.Locked=true
PG1.PinAttribute=Free
PG1.Signal=GPIO_Input
PG10.GPIOParameters=GPIO_Label,PinAttribute
PG10.GPIO_Label=QSPI_BK2_IO2 [MX25L51245G_SIO2]
PG10.Locked=true
PG10.Mode=Dual Bank
PG10.PinAttribute=BootROM,BootLoader,CortexA7NS
PG10.Signal=QUADSPI_BK2_IO2
PG11.GPIOParameters=GPIO_Label,PinAttribute
PG11.GPIO_Label=RS232_TX [ST3241EBPR_T2IN]
PG11.Locked=true
PG11.Mode=Asynchronous
PG11.PinAttribute=BootROM,BootLoader,CortexA7NS
PG11.Signal=UART4_TX
PG12.GPIOParameters=GPIO_Label,PinAttribute
PG12.GPIO_Label=SPDIF_RX [74LVC1G04SE]
PG12.Locked=true
PG12.Mode=IN1
PG12.PinAttribute=CortexA7NS
PG12.Signal=SPDIFRX_IN1
PG13.GPIOParameters=GPIO_Label,PinAttribute
PG13.GPIO_Label=ETH_TXD0 [RTL8211EG_TXD0]
PG13.Locked=true
PG13.Mode=RGMII (Reduced GMII)
PG13.PinAttribute=CortexA7NS
PG13.Signal=ETH1_TXD0
PG14.GPIOParameters=GPIO_Label,PinAttribute
PG14.GPIO_Label=ETH_TXD1 [RTL8211EG_TXD1]
PG14.Locked=true
PG14.Mode=RGMII (Reduced GMII)
PG14.PinAttribute=CortexA7NS
PG14.Signal=ETH1_TXD1
PG3.GPIOParameters=GPIO_Label,PinAttribute
PG3.GPIO_Label=CAN_STBY [MCP2562FDT-H_STBY]
PG3.Locked=true
PG3.PinAttribute=Free
PG3.Signal=GPIO_Output
PG4.GPIOParameters=GPIO_Label,PinAttribute
PG4.GPIO_Label=ETH_GTX_CLK [RTL8211EG_GTX_CLK]
PG4.Locked=true
PG4.Mode=RGMII (Reduced GMII)
PG4.PinAttribute=CortexA7NS
PG4.Signal=ETH1_GTX_CLK
PG5.GPIOParameters=GPIO_Label,PinAttribute
PG5.GPIO_Label=ETH_CLK125 [RTL8211EG_CLK125]
PG5.Locked=true
PG5.Mode=ETH 125MHz Clock Input
PG5.PinAttribute=CortexA7NS
PG5.Signal=ETH1_CLK125
PG6.GPIOParameters=GPIO_PuPd,GPIO_Label,PinAttribute
PG6.GPIO_Label=eMMC_SDIO2_CMD [THGBMDG5D1LBAIL_CMD]
PG6.GPIO_PuPd=GPIO_PULLUP
PG6.Locked=true
PG6.Mode=mmc_8_bits_Wide_bus
PG6.PinAttribute=BootROM,BootLoader,CortexA7NS
PG6.Signal=SDMMC2_CMD
PG7.GPIOParameters=GPIO_Label,PinAttribute
PG7.GPIO_Label=QSPI_BK2_IO3 [MX25L51245G_SIO3]
PG7.Locked=true
PG7.Mode=Dual Bank
PG7.PinAttribute=BootROM,BootLoader,CortexA7NS
PG7.Signal=QUADSPI_BK2_IO3
PG9.GPIOParameters=GPIO_PuPd,GPIO_Speed_High_Default,PinAttribute
PG9.GPIO_PuPd=GPIO_NOPULL
PG9.GPIO_Speed_High_Default=GPIO_SPEED_FREQ_HIGH
PG9.Locked=true
PG9.Mode=NandChipSelect3_1
PG9.PinAttribute=BootROM,BootLoader,CortexA7NS
PG9.Signal=FMC_NCE
PH0-OSC_IN.GPIOParameters=PinAttribute
PH0-OSC_IN.Locked=true
PH0-OSC_IN.Mode=HSE-DIG-External-Clock-Source
PH0-OSC_IN.PinAttribute=BootROM,BootLoader,CortexA7S,CortexA7NS,CortexM4
PH0-OSC_IN.Signal=RCC_OSC_IN
PH1-OSC_OUT.GPIOParameters=PinAttribute
PH1-OSC_OUT.Mode=HSE-DIG-External-Clock-Source
PH1-OSC_OUT.PinAttribute=BootROM,BootLoader,CortexA7S,CortexA7NS,CortexM4
PH1-OSC_OUT.Signal=RCC_OSC_OUT
PH10.GPIOParameters=GPIO_Label,PinAttribute
PH10.GPIO_Label=PAR_D1 [FPC05024_D3]
PH10.Locked=true
PH10.Mode=Slave_12_bits_External_Synchro
PH10.PinAttribute=CortexA7NS
PH10.Signal=DCMI_D1
PH11.GPIOParameters=GPIO_Label,PinAttribute
PH11.GPIO_Label=PAR_D2 [FPC05024_D4]
PH11.Locked=true
PH11.Mode=Slave_12_bits_External_Synchro
PH11.PinAttribute=CortexA7NS
PH11.Signal=DCMI_D2
PH12.GPIOParameters=GPIO_Label,PinAttribute
PH12.GPIO_Label=PAR_D3 [FPC05024_D5]
PH12.Locked=true
PH12.Mode=Slave_12_bits_External_Synchro
PH12.PinAttribute=CortexA7NS
PH12.Signal=DCMI_D3
PH13.GPIOParameters=GPIO_Speed,GPIO_Label,PinAttribute
PH13.GPIO_Label=CAN1_TX [MCP2562FDT-H_TXD]
PH13.GPIO_Speed=GPIO_SPEED_FREQ_MEDIUM
PH13.Locked=true
PH13.Mode=FDCAN_Activate
PH13.PinAttribute=CortexA7NS
PH13.Signal=FDCAN1_TX
PH14.GPIOParameters=GPIO_Label,PinAttribute
PH14.GPIO_Label=PAR_D4 [FPC05024_D6]
PH14.Locked=true
PH14.Mode=Slave_12_bits_External_Synchro
PH14.PinAttribute=CortexA7NS
PH14.Signal=DCMI_D4
PH15.GPIOParameters=PinAttribute
PH15.Mode=Slave_12_bits_External_Synchro
PH15.PinAttribute=CortexA7NS
PH15.Signal=DCMI_D11
PH2.GPIOParameters=GPIO_Label,PinAttribute
PH2.GPIO_Label=QSPI_BK2_IO0 [MX25L51245G_SIO0]
PH2.Locked=true
PH2.Mode=Dual Bank
PH2.PinAttribute=BootROM,BootLoader,CortexA7NS
PH2.Signal=QUADSPI_BK2_IO0
PH3.GPIOParameters=GPIO_Label,PinAttribute
PH3.GPIO_Label=QSPI_BK2_IO1 [MX25L51245G_SIO1]
PH3.Locked=true
PH3.Mode=Dual Bank
PH3.PinAttribute=BootROM,BootLoader,CortexA7NS
PH3.Signal=QUADSPI_BK2_IO1
PH4.GPIOParameters=GPIO_Label,PinAttribute
PH4.GPIO_Label=I2C2_SCL
PH4.Locked=true
PH4.Mode=I2C
PH4.PinAttribute=CortexA7NS
PH4.Signal=I2C2_SCL
PH5.GPIOParameters=GPIO_Label,PinAttribute
PH5.GPIO_Label=I2C2_SDA
PH5.Locked=true
PH5.Mode=I2C
PH5.PinAttribute=CortexA7NS
PH5.Signal=I2C2_SDA
PH7.GPIOParameters=PinAttribute
PH7.Locked=true
PH7.Mode=Slave_12_bits_External_Synchro
PH7.PinAttribute=CortexA7NS
PH7.Signal=DCMI_D9
PH8.GPIOParameters=GPIO_Label,PinAttribute
PH8.GPIO_Label=PAR_HSYNC [FPC05024_HREF]
PH8.Locked=true
PH8.Mode=Slave_12_bits_External_Synchro
PH8.PinAttribute=CortexA7NS
PH8.Signal=DCMI_HSYNC
PH9.GPIOParameters=GPIO_Label,PinAttribute
PH9.GPIO_Label=PAR_D0 [FPC05024_D2]
PH9.Locked=true
PH9.Mode=Slave_12_bits_External_Synchro
PH9.PinAttribute=CortexA7NS
PH9.Signal=DCMI_D0
PI1.GPIOParameters=PinAttribute
PI1.Mode=Slave_12_bits_External_Synchro
PI1.PinAttribute=CortexA7NS
PI1.Signal=DCMI_D8
PI3.GPIOParameters=PinAttribute
PI3.Mode=Slave_12_bits_External_Synchro
PI3.PinAttribute=CortexA7NS
PI3.Signal=DCMI_D10
PI4.GPIOParameters=GPIO_Label,PinAttribute
PI4.GPIO_Label=PAR_D5 [FPC05024_D7]
PI4.Locked=true
PI4.Mode=Slave_12_bits_External_Synchro
PI4.PinAttribute=CortexA7NS
PI4.Signal=DCMI_D5
PI5.GPIOParameters=GPIO_Label,PinAttribute
PI5.GPIO_Label=SAI2_SCKA [WM8994ECS_BCLK1]
PI5.Locked=true
PI5.Mode=SAI_A_MasterWithClock
PI5.PinAttribute=CortexA7NS
PI5.Signal=SAI2_SCK_A
PI6.GPIOParameters=GPIO_Label,PinAttribute
PI6.GPIO_Label=SAI2_SDA [WM8994ECS_DACDAT1]
PI6.Locked=true
PI6.Mode=SAI_A_MasterWithClock
PI6.PinAttribute=CortexA7NS
PI6.Signal=SAI2_SD_A
PI7.GPIOParameters=GPIO_Label,PinAttribute
PI7.GPIO_Label=SAI2_FSA [WM8994ECS_LRCLK1]
PI7.Locked=true
PI7.Mode=SAI_A_MasterWithClock
PI7.PinAttribute=CortexA7NS
PI7.Signal=SAI2_FS_A
PI8.GPIOParameters=GPIO_Label,PinAttribute
PI8.GPIO_Label=MFX_IRQOUT [STM32L152CCT6_IRQOUT]
PI8.Locked=true
PI8.PinAttribute=Free
PI8.Signal=GPIO_Input
PI9.GPIOParameters=GPIO_Label,PinAttribute
PI9.GPIO_Label=CAN1_RX [MCP2562FDT-H_RXD]
PI9.Locked=true
PI9.Mode=FDCAN_Activate
PI9.PinAttribute=CortexA7NS
PI9.Signal=FDCAN1_RX
PZ4.GPIOParameters=GPIO_Label,PinAttribute
PZ4.GPIO_Label=I2C4_SCL [STPMU1A_SCL]
PZ4.Locked=true
PZ4.Mode=I2C
PZ4.PinAttribute=BootLoader,CortexA7S,CortexA7NS
PZ4.Signal=I2C4_SCL
PZ5.GPIOParameters=GPIO_Label,PinAttribute
PZ5.GPIO_Label=I2C4_SDA [STPMU1A_SDA]
PZ5.Locked=true
PZ5.Mode=I2C
PZ5.PinAttribute=BootLoader,CortexA7S,CortexA7NS
PZ5.Signal=I2C4_SDA
PinOutPanel.CurrentBGAView=Top
PinOutPanel.RotationAngle=0
RCC.ADCFreq_Value=74250000
RCC.AHB1234Freq_Value=208877929.6875
RCC.AHB123Freq_Value=193500000
RCC.AHB12Freq_Value=64000000
RCC.AHB4Freq_Value=64000000
RCC.APB1DIV=RCC_APB1_DIV2
RCC.APB1Freq_Value=104438964.84375
RCC.APB2DIV=RCC_APB2_DIV2
RCC.APB2Freq_Value=104438964.84375
RCC.APB3DIV=RCC_APB3_DIV2
RCC.APB3Freq_Value=104438964.84375
RCC.APB4DIV=RCC_APB4_DIV2
RCC.APB4Freq_Value=133250000
RCC.APB5DIV=RCC_APB5_DIV4
RCC.APB5DIVClockFreq_Value=66625000
RCC.AXICLKFreq_VALUE=266500000
RCC.AXICLKSource=RCC_AXISSOURCE_PLL2
RCC.AXIClockFreq_Value=64000000
RCC.AXIDIVFreq_Value=266500000
RCC.CECFreq_Value=32768
RCC.CKPERCLKFreq_VALUE=24000000
RCC.CKPERCLKSource=RCC_CKPERCLKSOURCE_HSE
RCC.CKPERFreq_Value=64000000
RCC.CSI_VALUE=4000000
RCC.CortexFreq_Value=208877929.6875
RCC.CpuClockFreq_Value=64000000
RCC.D1CPREFreq_Value=64000000
RCC.DACCLKFreq_VALUE=32000
RCC.DDRCFreq_Value=533000000
RCC.DDRPERFMFreq_Value=533000000
RCC.DDRPHYFreq_Value=533000000
RCC.DFSDFAFreq_Value=24573874.08088235
RCC.DFSDMACLkFreq_Value=50390625
RCC.DFSDMFreq_Value=208877929.6875
RCC.DIVM1=3
RCC.DIVM2=3
RCC.DIVM3=2
RCC.DIVM4=4
RCC.DIVN1=81
RCC.DIVN2=66
RCC.DIVN3=34
RCC.DIVN4=99
RCC.DIVP1Freq_Value=650000000
RCC.DIVP2Freq_Value=266500000
RCC.DIVP3Freq_Value=208877929.6875
RCC.DIVP4=6
RCC.DIVP4Freq_Value=99000000
RCC.DIVQ1=1
RCC.DIVQ1Freq_Value=650000000
RCC.DIVQ2=1
RCC.DIVQ2Freq_Value=533000000
RCC.DIVQ3=17
RCC.DIVQ3Freq_Value=24573874.08088235
RCC.DIVQ4=8
RCC.DIVQ4Freq_Value=74250000
RCC.DIVR1=1
RCC.DIVR1Freq_Value=650000000
RCC.DIVR2=1
RCC.DIVR2Freq_Value=533000000
RCC.DIVR3=37
RCC.DIVR3Freq_Value=11290698.902027028
RCC.DIVR4=8
RCC.DIVR4Freq_Value=74250000
RCC.DSIFreq_Value=53500000
RCC.DSIPixelFreq_Value=74250000
RCC.DSIRXEscFreq_Value=60000000
RCC.DSITXEscFreq_Value=13375000
RCC.DSI_VALUE=53500000
RCC.ETHFreq_Value=99000000
RCC.FCLKFreq_Value=196000000
RCC.FDCANCLockSelection=RCC_FDCANCLKSOURCE_PLL4_R
RCC.FDCANFreq_Value=74250000
RCC.FMCCLockSelection=RCC_FMCCLKSOURCE_ACLK
RCC.FMCFreq_Value=266500000
RCC.FamilyName=M
RCC.HCLK3ClockFreq_Value=64000000
RCC.HCLK4ClockFreq_Value=193500000
RCC.HCLKFreq_Value=64000000
RCC.HSE_VALUE=24000000
RCC.HSIDivClkFreq_Value=64000000
RCC.HSI_VALUE=64000000
RCC.Hclk5DIVFreq_Value=266500000
RCC.Hclk6DIVFreq_Value=266500000
RCC.I2C123Freq_Value=64000000
RCC.I2C12CLockSelection=RCC_I2C12CLKSOURCE_HSI
RCC.I2C12Freq_Value=64000000
RCC.I2C35CLockSelection=RCC_I2C35CLKSOURCE_HSI
RCC.I2C35Freq_Value=64000000
RCC.I2C46CLockSelection=RCC_I2C46CLKSOURCE_HSI
RCC.I2C46Freq_Value=64000000
RCC.I2C4Freq_Value=64000000
RCC.IPParameters=ADCFreq_Value,AHB1234Freq_Value,AHB123Freq_Value,AHB12Freq_Value,AHB4Freq_Value,APB1DIV,APB1Freq_Value,APB2DIV,APB2Freq_Value,APB3DIV,APB3Freq_Value,APB4DIV,APB4Freq_Value,APB5DIV,APB5DIVClockFreq_Value,AXICLKFreq_VALUE,AXICLKSource,AXIClockFreq_Value,AXIDIVFreq_Value,CECFreq_Value,CKPERCLKFreq_VALUE,CKPERCLKSource,CKPERFreq_Value,CSI_VALUE,CortexFreq_Value,CpuClockFreq_Value,D1CPREFreq_Value,DACCLKFreq_VALUE,DDRCFreq_Value,DDRPERFMFreq_Value,DDRPHYFreq_Value,DFSDFAFreq_Value,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVM1,DIVM2,DIVM3,DIVM4,DIVN1,DIVN2,DIVN3,DIVN4,DIVP1Freq_Value,DIVP2Freq_Value,DIVP3Freq_Value,DIVP4,DIVP4Freq_Value,DIVQ1,DIVQ1Freq_Value,DIVQ2,DIVQ2Freq_Value,DIVQ3,DIVQ3Freq_Value,DIVQ4,DIVQ4Freq_Value,DIVR1,DIVR1Freq_Value,DIVR2,DIVR2Freq_Value,DIVR3,DIVR3Freq_Value,DIVR4,DIVR4Freq_Value,DSIFreq_Value,DSIPixelFreq_Value,DSIRXEscFreq_Value,DSITXEscFreq_Value,DSI_VALUE,ETHFreq_Value,FCLKFreq_Value,FDCANCLockSelection,FDCANFreq_Value,FMCCLockSelection,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLK4ClockFreq_Value,HCLKFreq_Value,HSE_VALUE,HSIDivClkFreq_Value,HSI_VALUE,Hclk5DIVFreq_Value,Hclk6DIVFreq_Value,I2C123Freq_Value,I2C12CLockSelection,I2C12Freq_Value,I2C35CLockSelection,I2C35Freq_Value,I2C46CLockSelection,I2C46Freq_Value,I2C4Freq_Value,LPTIM1CLockSelection,LPTIM1Freq_Value,LPTIM23CLockSelection,LPTIM23Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPTIM45CLockSelection,LPTIM45Freq_Value,LPUART1Freq_Value,LSI_VALUE,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,MCUCLKFreq_VALUE,MCUCLKSource,MCUClockFreq_Value,MCUDIVCLKFreq_Value,MPUCLKFreq_VALUE,MPUCLKSource,PLL12Source,PLL1FRACV,PLL1UserDefinedConfig,PLL2FRACV,PLL3FRACV,PLL3Source,PLL4FRACV,PLL4PDSIFreq_Value,PLL4Source,PLLDSIFreq_Value,PLLDSIIDF,PLLDSINDIV,PLLDSIODF,PLLDSIVCOFreq_Value,PLLSource,PLLSourceVirtual,PLLSourceVirtualString,PUBLFreq_Value,QSPICLockSelection,QSPIFreq_Value,RCC_RTC_Clock_Source_FROM_HSE,RNG1Freq_Value,RNG2Freq_Value,RTCClockSelection,RTCFreq_Value,SAI1CLockSelection,SAI1Freq_Value,SAI23Freq_Value,SAI2CLockSelection,SAI2Freq_Value,SAI3Freq_Value,SAI4AFreq_Value,SAI4BFreq_Value,SAI4CLockSelection,SAI4Freq_Value,SDMMC12CLockSelection,SDMMC12Freq_Value,SDMMC3CLockSelection,SDMMC3Freq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI123Freq_Value,SPI1Freq_Value,SPI23Freq_Value,SPI45CLockSelection,SPI45Freq_Value,SPI6CLockSelection,SPI6Freq_Value,STGENCLockSelection,STGENFreq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,Tim1OutputFreq_Value,Tim2OutputFreq_Value,UART78CLockSelection,UART78Freq_Value,USART16Freq_Value,USART1CLockSelection,USART1Freq_Value,USART234578Freq_Value,USART24CLockSelection,USART24Freq_Value,USART35CLockSelection,USART35Freq_Value,USART6CLockSelection,USART6Freq_Value,USBFreq_Value,USBOCLKSource,USBOFSFreq_Value,USBOHSFreq_Value,USBPHYCLKSource,USBPHYFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCO4OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value,VCOInput4Freq_Value
RCC.LPTIM1CLockSelection=RCC_LPTIM1CLKSOURCE_PCLK1
RCC.LPTIM1Freq_Value=104438964.84375
RCC.LPTIM23CLockSelection=RCC_LPTIM23CLKSOURCE_PCLK3
RCC.LPTIM23Freq_Value=104438964.84375
RCC.LPTIM2Freq_Value=64000000
RCC.LPTIM345Freq_Value=64000000
RCC.LPTIM45CLockSelection=RCC_LPTIM45CLKSOURCE_PCLK3
RCC.LPTIM45Freq_Value=104438964.84375
RCC.LPUART1Freq_Value=64000000
RCC.LSI_VALUE=32000
RCC.LTDCFreq_Value=74250000
RCC.MCO1PinFreq_Value=64000000
RCC.MCO2PinFreq_Value=650000000
RCC.MCUCLKFreq_VALUE=208877929.6875
RCC.MCUCLKSource=RCC_MCUSSOURCE_PLL3
RCC.MCUClockFreq_Value=208877929.6875
RCC.MCUDIVCLKFreq_Value=208877929.6875
RCC.MPUCLKFreq_VALUE=650000000
RCC.MPUCLKSource=RCC_MPUSOURCE_PLL1
RCC.PLL12Source=RCC_PLL12SOURCE_HSE
RCC.PLL1FRACV=0x800
RCC.PLL1UserDefinedConfig=false
RCC.PLL2FRACV=0x1400
RCC.PLL3FRACV=6660
RCC.PLL3Source=RCC_PLL3SOURCE_HSE
RCC.PLL4FRACV=0
RCC.PLL4PDSIFreq_Value=99000000
RCC.PLL4Source=RCC_PLL4SOURCE_HSE
RCC.PLLDSIFreq_Value=428000000
RCC.PLLDSIIDF=DSI_PLL_IN_DIV3
RCC.PLLDSINDIV=107
RCC.PLLDSIODF=DSI_PLL_OUT_DIV2
RCC.PLLDSIVCOFreq_Value=1712000000
RCC.PLLSource=RCC_PLL3SOURCE_HSI
RCC.PLLSourceVirtual=RCC_PLL3SOURCE_HSI
RCC.PLLSourceVirtualString=RCC_PLL3SOURCE_HSI
RCC.PUBLFreq_Value=533000000
RCC.QSPICLockSelection=RCC_QSPICLKSOURCE_ACLK
RCC.QSPIFreq_Value=266500000
RCC.RCC_RTC_Clock_Source_FROM_HSE=24
RCC.RNG1Freq_Value=4000000
RCC.RNG2Freq_Value=4000000
RCC.RTCClockSelection=RCC_RTCCLKSOURCE_LSE
RCC.RTCFreq_Value=32768
RCC.SAI1CLockSelection=RCC_SAI1CLKSOURCE_PLL3_Q
RCC.SAI1Freq_Value=24573874.08088235
RCC.SAI23Freq_Value=50390625
RCC.SAI2CLockSelection=RCC_SAI2CLKSOURCE_PLL3_Q
RCC.SAI2Freq_Value=24573874.08088235
RCC.SAI3Freq_Value=74250000
RCC.SAI4AFreq_Value=50390625
RCC.SAI4BFreq_Value=50390625
RCC.SAI4CLockSelection=RCC_SAI4CLKSOURCE_PLL3_Q
RCC.SAI4Freq_Value=24573874.08088235
RCC.SDMMC12CLockSelection=RCC_SDMMC12CLKSOURCE_PLL4
RCC.SDMMC12Freq_Value=99000000
RCC.SDMMC3CLockSelection=RCC_SDMMC3CLKSOURCE_HCLK2
RCC.SDMMC3Freq_Value=208877929.6875
RCC.SDMMCFreq_Value=50390625
RCC.SPDIFRXFreq_Value=99000000
RCC.SPI123Freq_Value=50390625
RCC.SPI1Freq_Value=99000000
RCC.SPI23Freq_Value=99000000
RCC.SPI45CLockSelection=RCC_SPI45CLKSOURCE_PCLK2
RCC.SPI45Freq_Value=104438964.84375
RCC.SPI6CLockSelection=RCC_SPI6CLKSOURCE_PCLK5
RCC.SPI6Freq_Value=66625000
RCC.STGENCLockSelection=RCC_STGENCLKSOURCE_HSE
RCC.STGENFreq_Value=24000000
RCC.SWPMI1Freq_Value=64000000
RCC.SYSCLKFreq_VALUE=64000000
RCC.Tim1OutputFreq_Value=208877929.6875
RCC.Tim2OutputFreq_Value=208877929.6875
RCC.UART78CLockSelection=RCC_UART78CLKSOURCE_PCLK1
RCC.UART78Freq_Value=104438964.84375
RCC.USART16Freq_Value=64000000
RCC.USART1CLockSelection=RCC_USART1CLKSOURCE_PCLK5
RCC.USART1Freq_Value=66625000
RCC.USART234578Freq_Value=64000000
